# Must not in before war
#  "must_not": ["اوکراین","روسیه","امریکا","اسرائیل","هند","پاکستان","ایالات متحده","آمریکا", "آمریکایی", "یمنی‌ها", "یمنی", "لبنان", "اسرائیلی", "سوریه", "رژیم صهیونیستی", "اوکراین", "راستین ایرلند", "صگیون", "اسرائیل", "سوریه", "رژیم‌صهیونیستی",
#                                               "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
#                                               "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
#                                               "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
#                                               "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
#                                               "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
#                                               "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
#                                               "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
#                                               "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
#                                               "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "روسیه", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
#                                               "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس", "صهیونسیتی"
#                                               "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "ایالات متحده", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ","مزدور",
#                                               "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه","#اسرائیل","#غزه","تروریستی"
#                                               "صهیونیستی", "صهیونیستی ","رژیم ","روسیه","اوکراینی","لبنان ","حلقه","آمریکایی","اسرائیل","اسراییل","کوریای شمالی","صهیونیست","اسرائیل","اسرائیلی"," یمن","صهیونسیتی ","اسراییلی","اسرائیلی","زلنسکی","پوتین","نازی","ازادی بخش","اسقاطیلی", "غزة", "غزه", "غزه", "خان‌یونس", "خان یونس"
#                                               "آزادی‌بخش", "آزادی بخش", "غزه",  "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "ارتش اشغالگر", "رژيم صهيونيستی", "اسراعیل", "راننده","تتلو","ساسی","متفقین ","ناتو ","روسی","پرسپولیس ", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "یحیا سینوار", "یحیا‌سینوار", "ارتش سرخ"]

config = [
    # {
    #     "name": "همه",
    #     "channel_id": -1002540835623,
    #     "bot_tokens": [
    #         {"username": "@sender_00000_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00001_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00002_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00006_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00007_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00008_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00009_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00015_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00016_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00017_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00018_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"}
    #     ],
    #     "roles": [
    #         {"must": [], "should": [], "must_not": [], "lable": ["خبر فارسی"]}
    #     ]
    # },
    # {
    #     "name": "ایران",
    #     "channel_id": -1002628169730,
    #     "bot_tokens": [
    #         {"username": "@sender_00003_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00004_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00010_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00011_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00019_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00020_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
    #         {"username": "@sender_00021_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"}
    #     ],
    #     "roles": [
    #         {"must": ["ایران"], "should": [], "must_not": [], "lable": ["ایران"]}
    #     ]
    # },
    {
        "name": "تحلیل وضعیت ۲",
        "channel_id": -1002778743721,
        "bot_tokens": [
            {"username": "sender_00022_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "sender_00023_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
        ],
        "roles": [
            {"must": ["سرلشکر موسوی","امیر موسوی"], "should": [], "must_not": []},
            {"must": ["سرلشگر حاتمی","امیر حاتمی"], "should": [], "must_not": []},
            {"must": ["امیر سیاری","دریادار سیاری","حبیب الله سیاری"], "should": [], "must_not": []},
            {"must": ["پوردستان"], "should": [], "must_not": []},
            {"must": ["محمدحسین دادرس","دادرس"], "should": [], "must_not": []},
            {"must": ["قرارگاه جنگ های نوپدید"], "should": [], "must_not": []},
            {"must": ["پوردستان"], "should": [], "must_not": []},
            {"must": ["رزمایش ارتش جمهوری اسلامی ایران"], "should": [], "must_not": []},
            {"must": ["ارتش جمهوری اسلامی ایران"], "should": [], "must_not": []},
            {"must": ["اجا","آجا"], "should": [], "must_not": []},
            {"must": ["اجامدیا","آجامدیا","اجا مدیا","آجا مدیا"], "should": [], "must_not": []},
            {"must": ["نپاجا"], "should": [], "must_not": []},
            {"must": ["قرارگاه پدافند هوایی"], "should": [], "must_not": []},
            {"must": ["شبکه یکپارچه پدافند هوایی"], "should": [], "must_not": []},
            {"must": ["سامانه پدافند هوایی"], "should": [], "must_not": []},
            {"must": ["اس ۳۰۰"], "should": [], "must_not": []},
            {"must": ["سامانه s300"], "should": [], "must_not": []},
            {"must": ["باور ۳۷۳"], "should": [], "must_not": []},
            {"must": ["سامانه پانزده خرداد"], "should": [], "must_not": []},
            {"must": ["سامانه ۱۵خرداد"], "should": [], "must_not": []},
            {"must": ["سوباشی"], "should": [], "must_not": []},
            {"must": ["سایت راداری"], "should": [], "must_not": []},
            {"must": ["پهپاد کرار"], "should": [], "must_not": []},
            {"must": ["پهپاد ارش","پهپاد آرش"], "should": [], "must_not": []},
            {"must": ["ورود اف ۳۵ به حریم هوایی ایران"], "should": [], "must_not": []},
            {"must": ["ورود جنگنده های اسرائیلی به حریم هوایی ایران"], "should": [], "must_not": []},
            {"must": ["سامانه مرصاد"], "should": [], "must_not": []},
            {"must": ["سامانه هاگ"], "should": [], "must_not": []},
            {"must": ["سرتیپ واحدی"], "should": [], "must_not": []},
            {"must": ["جنگنده فانتوم"], "should": [], "must_not": []},
            {"must": ["F14|تامکت"], "should": [], "must_not": []},
            {"must": ["جنگنده کوثر"], "should": [], "must_not": []},
            {"must": ["صباحی‌فرد","صباحی‌ فرد"], "should": [], "must_not": []},
            {"must": ["شهید ستاری"], "should": [], "must_not": []},
            {"must": ["دانشگاه افسری شهید ستاری"], "should": [], "must_not": []},
            {"must": ["سرتیپ نصیرزاده"], "should": [], "must_not": []},
            {"must": ["پهپاد کمان"], "should": [], "must_not": []},
            {"must": ["دریادار ایرانی"], "should": [], "must_not": []},
            {"must": ["شهرام ایرانی"], "should": [], "must_not": []},
            {"must": ["ناوشکن جماران"], "should": [], "must_not": []},
            {"must": ["ناوشکن سهند"], "should": [], "must_not": []},
            {"must": ["ناوبندر مکران"], "should": [], "must_not": []},
            {"must": ["سواحل مکران"], "should": [], "must_not": []},
            {"must": ["ناوشکن دماوند"], "should": [], "must_not": []},
            {"must": ["ناو خارک"], "should": [], "must_not": []},
            {"must": ["دانشگاه افسری امام خمینی"], "should": [], "must_not": []},
            {"must": ["نزاجا"], "should": [], "must_not": []},
            {"must": ["تیپ ۶۵"], "should": [], "must_not": []},
            {"must": ["نوهد"], "should": [], "must_not": []},
            {"must": ["سرتیپ حیدری","حیدری"], "should": [], "must_not": []},
            {"must": ["دریادار ایرانی"], "should": [], "must_not": []},
            {"must": ["شهرام ایرانی"], "should": [], "must_not": []},
            {"must": ["ناوشکن دنا"], "should": [], "must_not": []},
            {"must": ["ناوشکن البرز"], "should": [], "must_not": []},
            {"must": ["ناوشکن جماران"],"should": [], "must_not": []},
            {"must": ["ناوشکن سهند"], "should": [], "must_not": []},
            {"must": ["ناوگروه"], "should": [], "must_not": []},
            {"must": ["ناوبندر مکران"], "should": [], "must_not": []},
            {"must": ["ناوشکن دماوند"], "should": [], "must_not": []},
            {"must": ["ناو خارک"], "should": [], "must_not": []},
            {"must": ["زیردریایی فاتح"], "should": [], "must_not": []},
            {"must": ["دانشگاه افسری امام خمینی"], "should": [], "must_not": []},
            {"must": ["دانشگاه افسری نیروی دریایی"], "should": [], "must_not": []},
            {"must": ["دانشگاه علوم و فنون دریایی نوشهر"], "should": [], "must_not": []},
            {"must": ["ناوچه کنارک"], "should": [], "must_not": []},
            {"must": ["لشکر ۹۶ زرهی"], "should": [], "must_not": []},
            {"must": ["پایگاه هوایی دزفول"], "should": [], "must_not": []},
            {"must": ["پایگاه هوایی بندرعباس"], "should": [], "must_not": []},
            {"must": ["پایگاه هوایی بوشهر"], "should": [], "must_not": []},
            {"must": ["پایگاه هوایی چابهار"], "should": [], "must_not": []},
            {"must": ["نداجا"], "should": [], "must_not": []},
            {"must": ["نهاجا"], "should": [], "must_not": []},
            {"must": ["نزاجا"], "should": [], "must_not": []},
            {"must": ["پداجا"], "should": [], "must_not": []},
            {"must": ["میدان گازی آرش"], "should": [], "must_not": []},
            {
                "must": ["ریزش نیروها"], 
                "should": [], 
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["ریزش نیروهای ارتش"]
            },
            {
                "must": ["بدنه نظامی"], 
                "should": [], 
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["ارتش"]
            },
        ]
    },
    {
        "name": "ارتش",
        "channel_id": -1002680845262,
        "bot_tokens": [
            {"username": "@sender_00005_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00012_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00013_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00014_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},

            {"username": "@sender_00003_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00004_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00010_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00011_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00019_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00020_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00021_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00000_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00001_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00002_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00006_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00007_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00008_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00009_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00015_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00016_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00017_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
            {"username": "@sender_00018_bot", "token": "YOUR_TELEGRAM_BOT_TOKEN"},
        ],
        "roles": [
            
            # -------------------------- بیمارستان های ارتش --------------------------
            
            {"must": ["سازمانی", "ارتش"], "should": ["منزل", "منازل", "خانه"], "must_not": [], "lable": ["منازل سازمانی ارتش"]},
            {"must": ["کوی", "سازمانی", "ارتش"], "should": [], "must_not": [], "lable": ["منازل سازمانی ارتش"]},
            # -------------------------- فرماندهان و شهدای ارتش --------------------------
            
            # This line of code is checking if any of the words specified in the `role['must_not']` list
            # are present in the `message`.
          
            {"must": [ "امیر", "ارتش"], "should": [], "must_not": [],"lable": ["ارتش"]},
            {"must": ["سرلشکر باقری"], "should": [], "must_not": [], "lable": ["سرلشکر باقری"]},

            {"must": [], "should": ["امیر موسوی", "فرمانده کل ارتش", "سرلشکر موسوی", "امیر سید عبدالرحیم موسوی", "امیر عبدالرحیم موسوی"], "must_not": [], "lable": ["سرلشکر موسوی", "فرمانده کل ارتش"]},

            {"must": [], "should": ["امیر حبیب‌الله سیاری", "حبیب الله سیاری", "امیر حبیب‌ الله سیاری", "دریادار سیاری", "هماهنگ کننده ارتش", "امیر سیاری"], "must_not": ["فروشگاه"], "lable": ["امیر حبیب‌الله سیاری", "هماهنگ کننده ارتش"]},

            {"must": [], "should": ["امیر حیدری", "سرتیپ حیدری", "سرتیپ کیومرث حیدری"], "must_not": ["فروشگاه"], "lable": ["سرتیپ کیومرث حیدری", "فرمانده نیروی زمینی ارتش"]},

            {"must": [], "should": ["امیر پوردستان", "سرتیپ پوردستان", "احمدرضا پوردستان", "رئیس مرکز مطالعات و تحقیقات راهبردی ارتش جمهوری اسلامی ایران", "تحقیقات راهبردی ارتش", "رئیس مطالعات ارتش"], "must_not": ["فروشگاه"], "lable": ["احمدرضا پوردستان"]},

            {"must": [], "should": ["امیر محمدحسین دادرس", "امیر دادرس", "امیر محمد حسین دادرس", " جانشین فرمانده کل ارتش", "محمد حسین دادرس"], "must_not": ["فروشگاه"], "lable": ["سرتیپ محمدحسین دادرس"]},

            {"must": [], "should": ["دریادار شهرام ایرانی", "دریادار امیر ایرانی", "شهرام ایرانی", "فرمانده نیروی دریایی ارتش جمهوری اسلامی ایران"], "must_not": ["فروشگاه"], "lable": ["دریادار شهرام ایرانی"]},

            {"must": [], "should": ["حمید واحدی", "امیر واحدی", "سرتیپ حمید واحدی", "سرتیپ امیر واحدی"], "must_not": ["بلوار","خیابان","محله","مجتمع","مسکن","شهرک","کوچه","بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه"], "lable": ["فرمانده نیروی هوایی ارتش", "سرتیپ حمید واحدی"]},
            
            {"must": ["امیر آراسته"], "should": [], "must_not": [], "lable": ["آراسته"]},

            {"must": [], "should": ["تکاور صمدی", "ناخدا صمدی", "هوشنگ صمدی" "سرهنگ صمدی"], "must_not": [], "lable": ["تکاور هوشنگ صمدی"]},

            {"must": ["نصیرزاده"], "should": ["نهاجا", "ارتش",  "امیر", "سرتیپ", "فرمانده", "خلبان", "عزیز نصیرزاده"], "must_not": [], "lable": ["سرتیپ عزیز نصیرزاده", "وزیر دفاع و پشتیبانی نیروهای مسلح"]},

            {"must": ["حاتمی"], "should": ["مشاور فرمانده کل نیروهای مسلح", "امیر حاتمی", "سرتیپ", "وزیر سابق دفاع"], "must_not": [], "lable": ["سرتیپ امیر حاتمی", "مشاور فرمانده کل نیروهای مسلح"]},

            {"must": ["اسماعیلی"], "should": ["مشاور فرمانده کل نیروهای مسلح", "فرزاد اسماعیلی", "فرمانده", "پدافند هوایی", "پدافند ارتش", "فرمانده سابق پدافند", "پدافند"], "must_not": [], "lable": ["مشاور و دستیار فرمانده کل ارتش"]},

            {"must": ["نعمتی"], "should": ["امیر نعمتی", "نیروی زمینی", "جانشین فرمانده", "نوذر نعمتی", "سرتیپ", "تکاور"], "must_not": [], "lable": ["سرتیپ نوذر نعمتی", "جانشین فرمانده نیروی زمینی ارتش"]},

            {"must": ["امان‌اللهی"], "should": ["فرمانده دانشگاه افسری امام علی", "سیروس امان‌اللهی", "ارتش", "تکاور", "سرتیپ", "فرمانده", "دانشگاه امام علی", "دانشگاه افسری امام علی"], "must_not": []},
            {"must": ["امان‌ اللهی"], "should": ["فرمانده دانشگاه افسری امام علی", "سیروس امان‌اللهی", "ارتش", "تکاور", "سرتیپ", "فرمانده", "دانشگاه امام علی", "دانشگاه افسری امام علی"], "must_not": []},

            {"must": ["ولیوند"], "should": ["حسین ولی‌وند زمانی", "حسین ولی‌وند", "حسین ولیوند", "آجا", "ارتش", "سرتیپ", "فرمانده دانشگاه فرماندهی", "دانشگاه فرماندهی", "دافوس"], "must_not": []},
            {"must": ["ولی وند"], "should": ["حسین ولی‌وند زمانی", "حسین ولی‌وند", "حسین ولیوند", "آجا", "ارتش", "سرتیپ", "فرمانده دانشگاه فرماندهی", "دانشگاه فرماندهی", "دافوس"], "must_not": []},
            {"must": ["ولی‌وند"], "should": ["حسین ولی‌وند زمانی", "حسین ولی‌وند", "حسین ولیوند", "آجا", "ارتش", "سرتیپ", "فرمانده دانشگاه فرماندهی", "دانشگاه فرماندهی", "دافوس"], "must_not": []},

            {"must": ["الهامی"], "should": ["علیرضا الهامی", "ارتش", "جانشین", "سرتیپ", " جانشین فرمانده نیروی پدافند هوایی ارتش", "پدافند هوایی"], "must_not": []},

           
            {"must": [], "should": ["جمشید فولادی", "سرتیپ جمشید فولادی", "امیر فولادی"], "must_not": [],"lable": ["امیر فولادی"]},
            
            {"must": ["آشتیانی"], "should": ["محمدرضا قرایی آشتیانی", "محمدرضا آشتیانی", "محمد رضا قرایی آشتیانی", "محمد رضا آشتیانی", "سرتیپ", "ارتش", "جانشین", "نیروهای مسلح", "نیرو های مسلح"], "must_not": []},

            {"must": ["صباح فرد"], "should": ["علیرضا صباحی‌فرد", "علیرضا صباحی فرد", "فرمانده", "پدافند هوایی", "ارتش"], "must_not": []},
            {"must": ["صباحی‌فرد"], "should": ["علیرضا صباحی‌فرد", "علیرضا صباحی فرد", "فرمانده", "پدافند هوایی", "ارتش"], "must_not": []},

            {"must": ["شهبازیان"], "should": ["سرتیپ دوم شهبازیان", "علی شهبازیان", "سرتیپ", "ارتش", "فرمانده", "فرماندهان", "قرارگاه عملیاتی ۹۲ زرهی خوزستان", "۹۲ زرهی خوزستان", "قرارگاه عملیاتی", "ارشد نظامی ارتش در غرب کشور"], "must_not": []},

            {"must": ["آشناگر"], "should": ["مصطفی آشناگر", "خلبان", "سرتیپ", "ارتش", "فرمانده", "نیروی هوایی"], "must_not": []},
            {"must": ["رحمانی"], "should": ["مصطفی آشناگر", "خلبان", "سرتیپ", "ارتش", "فرمانده", "نیروی هوایی"], "must_not": []},

            {"must": ["علیرضایی"], "should": ["خلبان", "امیر خلبان علیرضا علیرضایی", "نهاجا", "خلبان"], "must_not": []},
            {"must": ["علیرضا علیرضایی", "ارتش"], "should": ["خلبان", "امیر خلبان علیرضا علیرضایی", "نهاجا", "خلبان"], "must_not": []},

            {"must": ["سرتیپ حسن شاهوارپور"], "should": ["فرمانده ارتش در اهواز", "سرتیپ حسن شاهوارپور"], "must_not": []},
            {"must": ["امیر حسینی مقدم"], "should": ["معاون آموزش ارتش", "امیر حسینی مقدم"], "must_not": []},
            {"must": ["سرتیپ علی اصغر پورشاسب"], "should": ["فرمانده دانشگاه دفاع ملی", "سرتیپ علی اصغر پورشاسب"], "must_not": []},
            {"must": ["دریادار فلاح"], "should": ["فرمانده نیروی دریایی", "دریادار فلاح"], "must_not": []},
            {"must": ["سرتیپ علی حاجیلو"], "should": ["ارشد نظامی آذربایجان", "سرتیپ علی حاجیلو"], "must_not": []},
            {"must": ["فرمانده منطقه پدافند هوایی شهید ستاری"], "should": ["پدافند", "فرمانده منطقه پدافند هوایی شهید ستاری"], "must_not": []},
            {"must": [" امیر شکاری"], "should": ["پدافند", "سرتیپ امیر شکاری"], "must_not": []},
            {"must": ["امیر بی‌غم"], "should": ["سخنگوی ارتش", "امیر بی‌غم"], "must_not": []},
            {"must": ["امیر عباسی"], "should": ["فرمانده نیروی زمینی", "امیر عباسی"], "must_not": []},
            {"must": ["سرتیپ بابایی"], "should": ["معاونت طرح و برنامه", "سرتیپ بابایی"], "must_not": []},
            {"must": ["امیر مهری"], "should": ["فرمانده قرارگاه غرب", "امیر مهری"], "must_not": []},
            {"must": ["سرتیپ دوم داودی"], "should": ["پدافند", "سرتیپ دوم داودی"], "must_not": []},
            {"must": ["محمدحسین دادرس"], "should": [], "must_not": []},
            {"must": ["سرتیپ قادر رحیم‌زاده"], "should": [], "must_not": []},
            {"must": ["عباس دوران"], "should": [], "must_not": []},
            {"must": ["عباس بابایی"], "should": [], "must_not": []},
            {"must": ["دادبین"], "should": [], "must_not": []},
            {"must": ["سرتیپ محمدیفر"], "should": [], "must_not": []},
            {"must": ["شهید ستاری"], "should": [], "must_not": ["بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه"]},
            {"must": ["شهید آبشناسان"], "should": [], "must_not": ["بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه"]},            
            {"must": ["دریادار کاویانی"], "should": [], "must_not": []},
            {"must": ["تکاور دریایی"], "should": [], "must_not": []},
            {"must": ["مهرداد آبدارباشی"], "should": [], "must_not": []},
            {"must": ["شهرام سبزواری"], "should": [], "must_not": []},
            {"must": ["برادران دل حامد"], "should": [], "must_not": []},
            {
                "must": ["ارشد نظامی"], 
                "should": [], 
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ]
            },

            {"must": ["پداجا"], "should": [], "must_not": [], "lable": ["قرارگاه پدافند هوایی خاتم‌الانبیا"]},
            {"must": [], "should": ["قرارگاه پدافند هوایی خاتم‌الانبیا", "قرارگاه پدافند هوایی", "پدافند هوایی خاتم‌الانبیا", "قرارگاه خاتم‌الانبیا", "قرارگاه پدافند هوایی خاتم‌ الانبیا", "قرارگاه پدافند هوایی", "پدافند هوایی خاتم‌ الانبیا", "قرارگاه خاتم‌ الانبیا"], "must_not": [], "lable": ["قرارگاه پدافند هوایی خاتم‌الانبیا"]},

            # -------------------------- فرماندهی های ارتش --------------------------
            {
                "must": [],
                "should": [
                    "فرمانده ارتش", "فرمانده کل ارتش", "ناخدا یکم", "معاون هماهنگ کننده نیروی دریایی",
                    "جانشین نیروی دریایی ارتش", "فرمانده تیپ ۳۵ تکاور", "فرمانده تیپ ۶۵ نوهد",
                    "فرمانده قرارگاه مرکزی ارتش", "فرمانده سابق ارتش", "جانشین فرمانده نیروی هوایی", 
                    "فرمانده یگان ویژه نزاجا", "یگان ویژه ارتش", "فرمانده هوانیروز", "هوانیروز", 
                    "دافوس", "رئیس دافوس", "دافوس ارتش", "فرمانده پدافند", "معاون عملیات ارتش",
                    "سخنگوی ارتش", "فرمانده قرارگاه شمال‌غرب نزاجا", "فرمانده قرارگاه جنوب شرق"
                ], 
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["فرمانده ارتش"]
            },

            # -------------------------- زیرمجموعه های ارتش --------------------------
            {"must": ["نداجا"], "should": [], "must_not": []},
            {"must": [], "should": [
                "نیروی دریایی ارتش جمهوری اسلامی ایران",
                "نیروی دریایی ارتش ایران",
                "نیروی دریایی ارتش جمهوری اسلامی",
                "نیروی دریایی ارتش ایران"
                ], "must_not": [], "lable": ["نیروی دریایی ارتش"]},

            {"must": ["نپاجا"], "should": [], "must_not": []},
            {"must": [], "should": [
                "نیروی پدافند هوایی ارتش جمهوری اسلامی",
                "پدافند هوایی ارتش جمهوری اسلامی", 
                "نیروی پدافند هوایی ارتش ایران",
                "پدافند هوایی ارتش ایران", 
                "پدافند هوایی جمهوری اسلامی", 
                "پدافند هوایی ایران", 
                "نیروی پدافند هوایی ارتش کشور ایران",
                "پدافند هوایی ارتش  کشور ایران"
            ], "must_not": [], "lable": ["نیروی پدافند هوایی ارتش"]},
            {"must": ["نزاجا"], "should": [], "must_not": []},
            {"must": [], "should": [
                "نیروی زمینی ارتش جمهوری اسلامی",
                "نیروی زمینی جمهوری اسلامی",
                "نیروی زمینی ارتش ایران",
                "نیروی زمینی ایران",
                "نیروی زمینی کشور ایران"
            ], "must_not": [], "lable": ["نیروی زمینی ارتش"]},

            {"must": ["بتاجا"], "should": [], "must_not": []},
            {"must": [], "should": [
                "بنیاد تعاون ارتش"
            ], "must_not": [], "lable": ["بنیاد تعاون ارتش"]},

            {"must": [], "should": ["آجا", "اجا"], "must_not": []},
            {"must": [], "should": [
                "ارتش جمهوری اسلامی",
                "ارتش ایران"
            ], "must_not": [], "lable": ["ارتش جمهوری اسلامی ایران"]},

            {"must": ["نهاجا"], "should": [], "must_not": []},
            {"must": [], "should": [
                "نیروی هوایی ارتش جمهوری اسلامی ایران",
                "نیروی هوایی ارتش جمهوری اسلامی",
                "نیروی هوایی ایران",
                "نیروی هوایی کشور ایران"
            ], "must_not": [], "lable": ["نیروی هوایی ارتش"]},

            # -------------------------- سامانه های ارتش --------------------------
            {
                "must": [],
                "should": ["s 300", "S 300", "s300", "S300", "اس 300", "اس300", "s ۳۰۰", "S ۳۰۰", "s۳۰۰", "S۳۰۰", "اس ۳۰۰", "اس۳۰۰",],
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["سامانه اس ۳۰۰"]
            },
            
            {
                "must": ["پدافند "],
                "should": [], 
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["پدافند ارتش"]
            },

            {"must": [], "should": ["سامانه مرصاد", "سامانه ۱۵‌خرداد", "سامانه ۱۵ خرداد", "سامانه پانزده خرداد", "سامانه پانزده‌خرداد", "سامانه پونزده خرداد", "سامانه پونزده‌خرداد"], "must_not": [], "lable": ["سامانه های ارتش"]},

            {
                "must": ["سامانه هاگ"], 
                "should": [],  
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["سامانه هاگ"]
            },
            
            {
                "must": ["ایران"],
                "should": [
                    "اف ۳۵", "اف‌۳۵", "اف 35", "اف‌35", "F35", "F 35", "f35", "f 35",
                    "اف ۱۶", "اف‌۱۶", "اف 16", "اف‌16", "F16", "F 16", "f16", "f 16"
                ],
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["جنگنده"]
            },

            {
                "must": ["پهپاد"], 
                "should": [
                    "ابابیل (پرستو)", "ابابیل-بی", "ابابیل-اس", "ابابیل-تی", "ابابیل-۲", "ابابیل-۳", 
                    "ابابیل-۵", "آرش", "آرش ۲", "تلاش ۱", "تلاش ۲", "تیزپر", "حازم",
                    "حماسه", "چابکپر", "رعد ۸۵", "سجیل", "سریر", "سفره‌ماهی", "سیمرغ",
                    "شاهد ۱۲۹", "شاهد ۱۳۱", "شاهد ۱۳۶", "شاهد ۱۴۷", "شاهین ۲۲", "صادق۱",
                    "صاعقه", "طوفان", "فرپاد", "فطرس", "کرار", "کمان ۱۲", "کمان ۲۲",
                    "کیان ۱", "کیان ۲", "مبین", "معراج", "مهاجر", "مهاجر-۲", "درنا", "مهاجر",
                    "مهاجر ۴", "مهاجر ۶", "مهاجر ۱۰", "ناصح", "هدف-۳۰۰۰", "هما", "یسیر",
                    "قائم/قاهر313"
                ],
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["پهپاد"]
            },

            {
                "must": [], 
                "should": [
                    "ناوبندر مکران", "ناوگروه ۸۶", "ناوچه کنارک", "زیردریایی فاتح", "ناوشکن البرز",
                    "F14 جنگنده", "f14 جنگنده", "f 14 جنگنده", "F 14 جنگنده", "جنگنده اف ۱۴", "جنگنده اف۱۴", "جنگنده اف 14", "جنگنده اف‌14", "پهپاد کرار",
                    "جنگنده کوثر", "پهپاد کمان", "ناوشکن جماران", "ناوشکن سهند", "ناوشکن دماوند",
                    "ناو خارک", "تانک چیفتن", "بالگرد کبری", "هلیکوپتر کبری",
                    "بالگرد شینوک", "باور ۳۷۳", "ناوشکن دنا", "جنگنده ایرانی"
                ],
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["تجهیزات ارتش"]
            },
            # -------------------------- حوادث تاریخی مربوط به ارتش --------------------------
            {"must": [], "should": ["کودتای نوژه", "کودتای‌نوژه", "کودتانوژه", "کودتا نوژه"], "must_not": []},
            {"must": [], "should": ["کودتای نقاب", "کودتای‌نقاب", "کودتانقاب", "کودتا نقاب"], "must_not": []},

            # -------------------------- رزمایش های ارتش --------------------------
            {
                "must": ["رزمایش"],
                "should": ["ارتش", "جمهوری اسلامی", "ذوالفقار", "فاتحان خیبر", "فاتحان‌خیبر"], 
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["رزمایش"]
            },

            # -------------------------- پاییگاه های ارتش --------------------------
            {
                "must": ["پایگاه"],
                "should": [
                   "شکاری", "نظامی", "هوایی", "کوشک", "ناجا", "قزل قشلاق", "شهید وطن‌پور", "شهید وطن پور",
                   "شوگا", "شهید بابایی", "شهید نوژه", "شهید فکوری", "نهاجا", "نداجا", "هوایی مهرآباد",
                   "بالگردی", "هوانیروز مسجدسلیمان", "هوانیروز کرمانشاه", "باند نظامی", "نزاجا"
                ],
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["پایگاه های ارتش"]
            },

            # # -------------------------- پادگان ها و میادین ارتش --------------------------
            
            {
                "must": ["پادگان"], 
                "should": [
                    "عجب شیر", "کرمان", "۰۱", "1", "۱" "01", "نامجو", "شهید نامجو", "جی", "۲۳", "تکاور", "لویزان", 
                    "دوکوهه", "02", "۰۲", "2", "۲", "03", "۰۳", "3", "۳" "تهران", "06", "۰۶", "پادگان یک", "پادگان دو",
                    "پادگان سه", "پادگان چهار", "پادگان پنج", "پادگان شش", "پادگان یکم", "پادگان دوم", "پادگان سهم",
                    "پادگان چهارم", "پادگان پنجم", "پادگان ششم", "مرزی", "عباس‌آباد", "آبیک"
                ],
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["پادگان های ارتش"]
            },
          
            # -------------------------- قرارگاه های ارتش --------------------------
            {
                "must": ["قرارگاه"], 
                "should": ["نوپدید", "جنگ های نوپدید", "پدافند هوایی"],
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["قرارگاه های ارتش"]
            },

            # -------------------------- دانشگاه های ارتش --------------------------
            {
                "must": ["دانشگاه"], 
                "should": [
                    "ستاری", "شهید ستاری", "خمینی", "امام خمینی", "نیروی دریایی", "نیرو دریایی",
                    "دانشگاه علوم و فنون دریایی نوشهر", "دانشگاه دریایی نوشهر", "دانشگاه علوم دریایی نوشهر", "دانشگاه پدافند", "دانشگاه نهاجا", "دانشگاه نداجا",
                    "دانشگاه امام خمینی نوشهر", "دانشگاه خمینی نوشهر", "دانشگاه علوم دریایی امام خمینی نوشهر", "دانشگاه ستاد ارتش", "دانشگاه فرماندهی", "دانشگاه امام علی"
                ],
                "must_not": [
                    "سپاه", "اوکراین","روسیه","امریکا","اسرائیل","هند","پاکستان","ایالات متحده","آمریکا", "آمریکایی", "یمنی‌ها", "یمنی", "لبنان", "اسرائیلی", "سوریه", "رژیم صهیونیستی", "اوکراین", "راستین ایرلند", "صگیون", "اسرائیل", "سوریه", "رژیم‌صهیونیستی",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی", "کوزوو", "کویت", 
                    "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", "موناکو",
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "روسیه", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس", "ترکیه",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "ایالات متحده", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ","مزدور","آزادی","آبی","ابی","هشتاد و پنج",
                    "صهیونیستی", "صهیونیستی ","رژیم ","روسیه","اوکراینی","لبنان ","حلقه","آمریکایی","اسرائیل","اسراییل","کوریای شمالی","صهیونیست","اسرائیل","اسرائیلی"," یمن","صهیونسیتی ","اسراییلی","اسرائیلی","زلنسکی","پوتین","نازی","ازادی بخش","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم", "غزه", "رژيم صهيونيستی", "اسراعیل"
                ],
                "lable": ["دانشگاه های ارتش"]
            },

            # -------------------------- ناوگان های ارتش --------------------------
            {"must": ["ناوگان شمال"], "should": ["نداجا", "دریای خزر", "ناوگان شمال"], "must_not": ["سپاه"],"lable": ["ناوگان "]},
            {"must": ["ناوگان جنوب"], "should": ["نداجا", "خلیج فارس", "ناوگان جنوب"], "must_not": ["سپاه"],"lable": ["ناوگان"]},

            # -------------------------- مناطق نظامی ارتش --------------------------
            {"must": ["منطقه نظامی کرمانشاه"], "should": ["یگان غرب کشور", "منطقه نظامی کرمانشاه"], "must_not": ["سپاه"],"lable": ["منطقه نظامی"]},
            {"must": ["منطقه نظامی سرپل‌ذهاب"], "should": ["ارتش غرب", "منطقه نظامی سرپل‌ذهاب"], "must_not": ["سپاه"],"lable": ["منطقه نظامی"]},
            {"must": [" پدافند هوایی شمال غرب"], "should": ["پدافند ارتش", "منطقه پدافند هوایی شمال غرب"], "must_not": ["سپاه"], "lable": ["پدافند هوایی ارتش"]},
            {"must": [" پدافند هوایی جنوب شرق"], "should": ["پدافند خاتم الانبیا", "منطقه پدافند هوایی جنوب شرق"], "must_not": ["سپاه"], "lable": ["پدافند هوایی ارتش"]},

            # -------------------------- لشکر های ارتش --------------------------
            {"must": [], "should": ["لشکر زرهی زاهدان", "زرهی اهواز", "لشکر ۹۲ زرهی اهواز", "لشکر ۸۸ زرهی زاهدان", "لشکر ۱۶ زرهی قزوین", "لشکر ۲۸ سنندج", "لشکر ۹۶ زرهی"], "must_not": [], "lable": ["لشکر های ارتش"], "lable": ["لشکر های ارتش"]},

            # -------------------------- یگان های ۹ گانه تکاوران ارتش --------------------------
            {
                "must": [], 
                "should": ["تیپ ۶۵", "تیپ۶۵", "تیپ۶۵‌",
                    "تیپ ۴۵", "تیپ۴۵", "تیپ۴۵‌",
                    "تیپ ۵۵", "تیپ۵۵", "تیپ۵۵‌",
                    "تیپ ۳۵", "تیپ۳۵", "تیپ۳۵‌",
                    "تیپ ۲۵", "تیپ۲۵", "تیپ۲۵‌",
                    "تیپ ۴۵", "تیپ۴۵", "تیپ۴۵‌",
                    "تیپ ۲۸۵", "تیپ۲۸۵", "تیپ۲۸۵",
                    "تیپ ۵۸", "تیپ۵۸", "تیپ۵۸",
                    "تیپ ۲۲۳", "تیپ۲۲۳", "تیپ۲۲۳",
                    "تیپ ۱۲۳", "تیپ۱۲۳", "تیپ۱۲۳",
                ], 
                "must_not": ["سپاه", "بسیج"], 
                "lable": ["تیپ های تکاوران ارتش"]
            },
            {"must": [], "should": ["تیپ نوهد", "تیپ نهبندان", "تیپ پرندک", "هوابرد شیراز", "نوهد"]
                                    , "must_not": ["سپاه", "بسیج", "قدس", "قرارگاه قدس", "عصائب", "حزب‌الله"], "lable": ["تیپ های تکاوران ارتش"]},

            # # -------------------------- باقی موارد مرتبط به ارتش --------------------------

            {"must": ["سوباشی"], "should": [], "must_not": [],"lable": ["سوباشی"]},
            {"must": ["سایت راداری"], "should": [], "must_not": []},
            {"must": ["سواحل مکران"], "should": ["رزمایش"], "must_not": ["سپاه"],"lable": ["مکران"]},
            {
                "must": ["دریابان"], 
                "should": [], 
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["نیروی دریایی"]
            },
            {
                "must": ["ناوگروه"], 
                "should": [], 
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["ناوگروه"]
            },
            {
                "must": ["ریزش نیروها"], 
                "should": [], 
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["ریزش نیروهای ارتش"]
            },
            {
                "must": ["بدنه نظامی"], 
                "should": [], 
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["ارتش"]
            },
            {"must": ["عقیدتی", "ارتش"], "should": [], "must_not": ["سپاه"],"lable": ["عقیدتی"]},

            {"must": ["دافوس"], "should": [], "must_not": [],"lable": ["دافوس"]},

            {"must": ["دانشگاه جنگ"], "should": [], "must_not": [],"lable": ["دافوس"]},

            {"must": ["دوشان تپه"], "should": ["پاییگاه", "ارتش", "یازدهم شکاری"], "must_not": [],"lable": ["دوشان تپه"]},

            {"must": ["عملیات مروارید"], "should": [], "must_not": []},

            {"must": ["کد ۳۶۰"], "should": [], "must_not": []},

            {"must": ["میدان گازی آرش"], "should": [], "must_not": []},

            {"must": ["خلیج عدن"], "should": [], "must_not": []},

            {"must": ["چیتگر"], "should": ["برج","گیاه شناسی", "اعتصاب","سهام","بتاجا","پهنه "], "must_not": [],"lable": ["چیتگر"]},

            {"must": [], "should": ["شهید دورانی", "شهید‌دورانی"], "must_not": ["بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "چهار راه", "چهار‌راه"]},

            {"must": ["عباس دوران"], "should": [], "must_not": []},

            {"must": [], "should": ["درمانگاه نظامی", "مرکز بهداشت ارتش"], "must_not": ["سپاه"]},

            {"must": [], "should": ["صبحگاه نظامی", "میدان صبحگاه"], "must_not": ["سپاه"]},

            {"must": [], "should": ["نزاجا", "مقر نیروی زمینی"], "must_not": ["سپاه"], "lable": ["نیروی زمینی ارتش"]},

            {"must": [], "should": ["نمازخانه پادگان", "سالن عقیدتی"], "must_not": ["سپاه"],"lable": ["عقیدتی"]},

            {
                "must": ["ارتش"], 
                "should": [], 
                "must_not": [
                    "هند", "سوریه", "راستین ایرلند", "صگیون", "سوریه",
                    "افغانستان", "آلبانی", "الجزایر", "آندورا", "آنگولا", "آرژانتین", "ارمنستان", "استرالیا", "اتریش", "آذربایجان", "باهاما", "بحرین", "بنگلادش", "باربادوس", "بلاروس", "بلژیک", "بلیز", "بنین", "بوتان", "بولیوی", "بوسنی و هرزگوین", "بوتسوانا",
                    "برزیل", "برونئی", "بلغارستان", "بورکینافاسو", "بوروندی", "کامبوج", "کامرون", "کانادا", "کیپ ورد", "جمهوری آفریقای مرکزی", "چاد", "شیلی", "چین", "کلمبیا", "کومور", "کنگو", "کاستاریکا", "کرواسی", "کوبا", "قبرس", "جمهوری چک", "دانمارک",
                    "جیبوتی", "دومینیکا", "جمهوری دومینیکن", "اکوادور", "مصر", "السالوادور", "گینه استوایی", "اریتره", "استونی", "اسواتینی", "اتیوپی", "فیجی", "فنلاند", "فرانسه", "گابن", "گامبیا", "گرجستان", "آلمان", "غنا", "یونان", "گرنادا", "گواتمالا",
                    "گینه", "گینه بیسائو", "گویان", "هائیتی", "هندوراس", "مجارستان", "ایسلند", "هند", "اندونزی", "عراق", "جمهوری ایرلند", "ایتالیا", "جامائیکا", "ژاپن", "اردن", "قزاقستان", "کنیا", "کیریباتی", "کره شمالی", "کرۀ شمالی", "کره جنوبی", "کرۀ جنوبی",
                    "کوزوو", "کویت", "قرقیزستان", "لائوس", "لتونی", "لیسوتو", "لیبریا", "لیبی", "لیختن اشتاین", "لیتوانی", "لوکزامبورگ", "ماداگاسکار", "مالاوی", "مالزی", "مالدیو", "مالی", "مالت", "جزایر مارشال", "موریتانی", "موریس", "مکزیک", "میکرونزی", "مولداوی", 
                    "مغولستان", "مونته نگرو", "مراکش", "موزامبیک", "میانمار", "نامیبیا", "نائورو", "نپال", "هلند", "نیوزیلند", "نیکاراگوئه", "نیجر", "نیجریه", "مقدونیه شمالی", "نروژ", "عمان", "پاکستان", "پالائو", "پاناما", "پاپوآ گینه نو", "پاراگوئه", "پرو",
                    "فیلیپین", "لهستان", "پرتغال", "قطر", "رومانی", "رواندا", "سنت کیتس و نویس", "سنت لوسیا", "سنت وینسنت و گرنادین‌ها", "ساموآ", "سان مارینو", "سائوتومه و پرینسیپ", "عربستان سعودی", "سنگال", "صربستان", "سیشل", "سیرالئون", "سنگاپور", 
                    "اسلواکی", "اسلوونی", "جزایر سلیمان", "سومالی", "آفریقای جنوبی", "سودان جنوبی", "سودان", "سریلانکا", "سورینام", "سوئد", "سوئیس", "تایوان", "تاجیکستان", "تانزانیا", "تایلند", "تیمور شرقی", "توگو", "تونگا", "ترینیداد و توباگو", "تونس",
                    "ترکمنستان", "تووالو", "اوگاندا", "امارات متحده عربی", "بریتانیا", "اروگوئه", "ازبکستان", "وانواتو", "واتیکان", "ونزوئلا", "ویتنام", "یمن", "زامبیا", "زیمبابوه","میانمار","غنا","کره‌ شمالی","کره جنوبی","ازادی","سرخ",
                    "آبی","ابی","هشتاد و پنج","فوتبال","تک نفر","استقلال","پرسپولیس","تراکتور","ترک","مخفی","سایه","فوتبال","تراختور","نتانیاهو","ترامپ","شوروی","جهود", "خلق","فاشیست","فاشیستی","فاشیسم","موناکو","آزادی","ترکیه",
                    "رژیم ", "حلقه", "کوریای شمالی", "نازی","ازادی بخش","اسقاطیلی", "خان‌یونس", "خان یونس"
                    "آزادی‌بخش", "آزادی بخش", "بزرگراه", "خیابان", "میدان", "بلوار", "اتوبان", "بیمارستان", "کوچه", "مدرسه", "کتاب", "چهار راه", "چهار‌راه", "راننده","تتلو","ساسی","متفقین ","ناتو ", "پرسپولیس", "روس", "ارتش سرخ", "ارتش‌سرخ", "ارتش باطری", "ارتش‌باطری", "ارتش باتری", "ارتش‌باتری", "ارتش سرخ"
                ],
                "lable": ["ارتش"]
            },
            
           
            {
                "must": [],
                "should": ["جاسوس", "خودفروخته", "خود فروخته", "خود‌فروخته", "خرابکار", "خرابکاری", "موشک", "پهپاد"],
                "must_not": [],
                "lable": ["جنگ ایران و اسراییل"],
            },
            {
                "must": ["خلبان"],
                "should": [
                    "دستگیر", "دستگیری", "F35", "F 35", "f35", "f 35", "F۳۵", "F ۳۵", "f۳۵", "f ۳۵",
                    "اف ۳۵", "اف‌۳۵", "اف 35", "اف‌35", "F35", "F 35", "f35", "f 35",
                    "اف ۱۶", "اف‌۱۶", "اف 16", "اف‌16", "F16", "F 16", "f16", "f 16"
                ],
                "must_not": [],
                "lable": ["خلبان", "جنگ ایران و اسراییل", "جنگنده"],
            }
        ]
    }
]
