from keywords.routing_rules import should_block
from keywords.routing_rules import must_not_block
from keywords.routing_rules import must_not_country_block


events = {

    # Event 1 - بیست و یک فروردین: روز شهادت امیر سپهبد علی صیاد شیرازی
    1: {
        "must": [
            ["صیاد","شیرازی"]
        ], 
        "should": [
            should_block + ["ایران","روز","علی","فروردین","۲۱","21"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Event 2 - بیست و نه فروردین: روز ارتش جمهوری اسلامی ایران و نیروی زمینی      
    2: {
        "must": [
            ["روز ارتش"]
        ], 
        "should": [
            should_block + ["ایران","جمهوری اسلامی","فروردین","۲۹","29"]
        ], 
        "must_not": [
            must_not_block + must_not_country_block
        ]
    },

    # Event 3 - سه اردیبهشت: روز شهادت امیر سپهبد سید محمدولی قرنی
    3: {
        "must": [
            ["قرنی"]
        ],
        "should": [
            should_block + ["محمدولی","سید","اردیبهشت","۳","3"]
        ],
        "must_not": [
            must_not_block
        ]
    },

    # Event 4 -  پنج اردیبهشت: روز شکست حمله نظامی آمریکا به ایران در طبس
    4: {
        "must": [
            ["طبس", "ایران", "آمریکا"]
        ],
        "should": [
            should_block + ["روز","اردیبهشت","۵","5"]
        ],
        "must_not": [
            []
        ]
    },

    # Event 5 - سه خرداد: روز فتح خرمشهر در عملیات بیت المقدس و روز مقاومت، ایثار و پیروزی
    5: {
        "must": [
            []
        ], 
        "should": [
            ["عملیات بیت المقدس","فتح خرمشهر","آزادسازی خرمشهر"]
        ], 
        "must_not": [
            []
        ]
    },

    # Event 6 - هجده تیر: روز کشف توطئه آمریکایی در پایگاه هوایی شهید نوژه همدان نیروی هوایی ارتش 
    6: {
        "must": [
            ["نوژه"]
        ], 
        "should": [
            ["توطئه","کودتا","تیر","۱۸","18"]
        ], 
        "must_not": [
            []
        ]
    },

    # Event 7 - پنج مرداد: روز عملیات مرصاد 
    7: {
        "must": [
            ["عملیات مرصاد"]
        ], 
        "should": [
            should_block + ["ایران","صیاد","شیرازی","مرداد","۵","5"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Event 8 - پانزده مرداد: روز شهادت امیر سرلشکر خلبان عباس بابایی 
    8: {
        "must": [
            ["بابایی","عباس"]
        ], 
        "should": [
            should_block + ["ایران","روز","مرداد","۱۵","15"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Event 9 - ده شهریور: روز نیروی پدافند ارتش جمهوری اسلامی ایران 
    9: {
        "must": [
            []
        ], 
        "should": [
            ["روز نیروی پدافند ارتش","روز پدافند ارتش","روز نیرو پدافند ارتش"]
        ], 
        "must_not": [
            must_not_country_block
        ]
    },
    
    # Event 10 - سی و یک شهریور: روز آغاز هفته دفاع مقدس 
    10: {
        "must": [
            ["دفاع مقدس"]
        ], 
        "should": [
            should_block + ["ایران","جمهوری اسلامی","شهریور","۳۱","31"]
        ],
        "must_not": [
            []
        ]
    },

    # Event 11 - چهار مهر: روز سرباز   
    11: {
        "must": [
            ["روز سرباز"]
        ], 
        "should": [
            should_block + ["سربازی","ایران","جمهوری اسلامی","مهر","۴","4"]
        ],
        "must_not": [
            []
        ]
    },

    # Event 12 - پنج مهر: روز شکست حصر آبادان   
    12: {
        "must": [
            ["حصر آبادان"]
        ], 
        "should": [
            should_block + ["مهر","۵","5"]
        ], 
        "must_not": [
            []
        ]
    },


    # Event 13 - هفت مهر: روز بزرگداشت فرماندهان شهید دفاع مقدس   
    13: {
        "must": [
            []
        ], 
        "should": [
            ["فرماندهان دفاع مقدس","فرمانده دفاع مقدس"]
        ], 
        "must_not": [
            []
        ]
    },

    # Event 14 - هفت آذر: روز نیروی دریایی ارتش جمهوری اسلامی ایران 
    14: {
        "must": [
            []
        ], 
        "should": [
            ["روز نیروی دریایی ارتش","روز نیرو دریایی ارتش"]
        ], 
        "must_not": [
            must_not_country_block
        ]
    },

    # Event 15 - نوزده بهمن: روز نیروی هوایی ارتش جمهوری اسلامی ایران   
    15: {
        "must": [
            []
        ], 
        "should": [
            ["روز نیروی هوایی ارتش","روز نیرو هوایی ارتش"]
        ], 
        "must_not": [
            must_not_country_block
        ]
    }
}