filter_daily_popular_posts = {
    "must": [
        []
    ],
    "should": [
        [
            # Politics & Governance
            "سیاست", "دولت", "انتخابات", "رییس‌ جمهور", "مجلس", "سنا", "پارلمان",
            "دیپلماسی", "استراتژی", "امنیت", "وزارت‌ خارجه", "وزیر", "سیاست‌ گذاری",
            "قانونگذاری", "تصویب", "قوه‌ مقننه", "قوه‌ مجریه", "قوه‌ قضائیه", "مصوبه",
            "حکومت", "دولت‌ مردان", "نمایندگان", "رئیس‌ مجلس", "وزارت‌ کشور", "انتخاباتی",
            "نظام‌سیاسی", "معاهدات", "توافقنامه", "سیاست‌ خارجی", "تحریم", "مجمع‌ تشخیص",
            "سازمان‌ ملل", "دیپلماسی‌ بین‌الملل", "مذاکره", "سیاست‌ ملی", "امنیت‌ ملی",
            "حقوق‌بشر", "اعتراضات", "قانون‌اساسی", "قوه‌ عدلیه", "سازمان‌ها", "حزب", 
            "سیاست‌ اقتصادی", "سیاست‌ اجتماعی", 

            # Military & Security
            "نظامی", "ارتش", "سپاه", "نیروی‌ زمینی", "نیروی‌ هوایی", "نیروی‌ دریایی", "دفاع",
            "جنگ", "عملیات", "تمرین", "رزمایش", "نیروها", "درگیری", "پدافند", "امنیت‌ ملی",
            "مرزها", "تجهیز انتظامی", "سلاح", "موشک", "ناو", "پهپاد", "نیروی‌انتظامی",
            "پلیس", "جاسوسی", "مبارزه‌ با‌ تروریسم", "کنترل‌ مرز", "امنیت‌ داخلی", "تهدید",
            "حفاظت‌ زیرساخت", "رزمایش‌ نظامی", "حفاظت ‌مرزها", "جنگ‌ الکترونیک",

            # Economy & Finance
            "اقتصاد", "تورم", "صنعت", "بازار", "سرمایه‌ گذاری", "مالی", "بورس‌ اوراق",
            "بورس", "تجارت", "ارز", "طلا", "نفت", "گاز", "بودجه", "مالیات", "کالا",
            "اشتغال", "کارآفرینی", "سرمایه‌گذاری‌ خارجی", "تجارت‌ خارجی", "صادرات",
            "واردات", "بازار سرمایه", "بانک‌ مرکزی", "اقتصاد‌ ملی", "توسعه‌ اقتصادی", 
            "پیشرفت", "صنعت‌ نفت", "انرژی", "فقر", "رشد اقتصادی", "نرخ تورم", 
            "بازار مسکن", "بازار کار", "تجارت‌ الکترونیک", 

            # Iran & National Issues
            "ایران", "کشور", "ملت", "تهران", "مردم", "قانون", "حکومت", "ایرانی",
            "مرز", "استان", "شهرستان", "مراکز‌ دولتی", "دولت‌ مرکزی", "ادارات",
            "سازمان", "اقتصاد ‌ملی", "سیاست‌  ملی", "فرهنگ", 

            # Technology & Science
            "تکنولوژی", "فناوری", "هوش‌ مصنوعی", "روباتیک", "نانو", "فضا", "ماهواره",
            "اینترنت", "داده‌کاوی", "شبکه‌های‌اجتماعی", "امنیت ‌سایبری",
            "توسعه‌فناوری", "ابداع", "نوآوری", "تحقیق", "پژوهش", "علمی", "رباتیک",
            "نانو‌فناوری", "فضاپیما", "ماهواره‌ای", "تکنولوژی‌جدید", "فناوری‌اطلاعات",
            "اینترنت‌ اشیا", "داده‌ بزرگ", "امنیت‌ دیجیتال", "تجارت‌الکترونیک"
        ]
    ],
    "must_not": [
        [
            "شوخی", "طنز", "میم", "خنده", "سرگرمی", "فان", "جوک", "لطیفه",
            "مسخره", "کاریکاتور", "خنده‌دار"
        ]
    ]
}