from keywords.routing_rules import should_block
from keywords.routing_rules import must_not_block
from keywords.routing_rules import must_not_country_block


persons = {
    # Person 1 - رهبری
    1: {
        "must": [
            []
        ],
        "should": [
            ["رهبری ایران","رهبر ایران","رهبر جمهوری اسلامی","رهبری جمهوری اسلامی","خامنه‌ای","خامنه ای","فرمانده کل قوا","فرمانده معظم کل قوا"]
        ],
        "must_not": [
            must_not_block
        ]
    },

    # Person 2 - موسوی
    2: {
        "must": [
            ["موسوی"],

            [],

            []
        ],
        "should": [
            should_block,

            ["رییس ستاد کل","رئیس ستاد کل","فرمانده ستاد کل"],

            [
                "رئیس ستاد کل نیروهای مسلح ایران","رییس ستاد کل نیروهای مسلح ایران","رییس ستاد کل ایران","رئیس ستاد کل ایران",
                "فرمانده ستاد کل نیروهای مسلح ایران","فرمانده ستاد کل ایران",

                "رئیس ستاد کل نیروهای مسلح جمهوری اسلامی","رییس ستاد کل نیروهای مسلح جمهوری اسلامی","رییس ستاد کل جمهوری اسلامی","رئیس ستاد کل جمهوری اسلامی",
                "فرمانده ستاد کل نیروهای مسلح جمهوری اسلامی","فرمانده ستاد کل جمهوری اسلامی"
            ]
        ],
        "must_not": [
           must_not_block + ["سردار موسوی", "فرمانده هوافضای سپاه"],

           must_not_country_block + ["نائب رئیس","نائب رییس","نایب رئیس","نایب رییس","جانشین فرمانده ستاد کل","مشاور رئیس","مشاور رییس","مشاور فرمانده ستاد کل"],

           ["نائب رئیس", "نائب رییس", "نایب رئیس", "نایب رییس", "جانشین فرمانده ستاد کل"]
        ]
    },

    # Person 3 - حاتمی
    3: {
        "must": [
            ["حاتمی"],

            [],

            []
        ],
        "should": [
            should_block,

            ["فرمانده کل ارتش","فرمانده ارتش"],

            ["فرمانده کل ارتش جمهوری اسلامی","فرمانده کل ارتش ایران","فرمانده ارتش ایران","فرمانده ارتش جمهوری اسلامی"]
        ],
        "must_not": [
            must_not_block + ["جانشین فرمانده"],

            must_not_country_block + ["جانشین فرمانده","فرمانده کل ارتش شاهنشاهی","فرمانده ارتش شاهنشاهی"],

            ["جانشین فرمانده"]
        ]
    },

    # Person 4 - نصیرزاده
    4: {
        "must": [
            ["نصیرزاده"],

            ["نصیر زاده"],

            [],

            []
        ],
        "should": [
            should_block,

            should_block,

            ["وزیر دفاع"],

            ["وزیر دفاع ایران","وزیر دفاع و پشتیبانی نیروهای مسلح ایران","وزیر دفاع جمهوری اسلامی","وزیر دفاع و پشتیبانی نیروهای مسلح جمهوری اسلامی"]
        ],
        "must_not": [
            must_not_block + ["جانشین وزیر"],

            must_not_block + ["جانشین وزیر"],

            must_not_country_block + ["جانشین وزیر","وزیر دفاع سابق","قائم مقام اسبق وزیر دفاع","معاون وزیر دفاع"],

            ["جانشین وزیر"]
        ]
    },

    # Person 5 - دادرس
    5: {
        "must": [
            ["دادرس"],

            [],

            []
        ],
        "should": [
            should_block,

            ["جانشین فرمانده کل ارتش","جانشین فرمانده ارتش"],

            ["جانشین فرمانده کل ارتش ایران","جانشین فرمانده ارتش ایران","جانشین فرمانده کل ارتش جمهوری اسلامی","جانشین فرمانده ارتش جمهوری اسلامی"]
        ],
        "must_not": [
            must_not_block,

            must_not_country_block + ["جانشین فرمانده کل ارتش شاهنشاهی","جانشین فرمانده ارتش شاهنشاهی"],

            []
        ]
    },

    # Person 6 - حیدری
    6: {
        "must": [
            ["حیدری"],

            [],

            []
        ],
        "should": [
            should_block,

            ["فرمانده نیروی زمینی ارتش","فرمانده نزاجا"],

            ["فرمانده نیروی زمینی ارتش ایران","فرمانده نیروی زمینی ارتش جمهوری اسلامی"]
        ],
        "must_not": [
            must_not_block + ["علی","پور","پور حیدری"],

            must_not_country_block + ["جانشین فرمانده","مشاور فرمانده","فرمانده نیروی زمینی ارتش شاهنشاهی"],

            ["جانشین فرمانده","مشاور فرمانده"]
        ]
    },

    # Person 7 - سیاری
    7: {
        "must": [
            ["سیاری"],

            [],

            []
        ],
        "should": [
            should_block,

            ["رئیس ستاد ارتش","رییس ستاد ارتش","فرمانده ستاد ارتش","معاون هماهنگ کننده ارتش","معاون هماهنگ‌کننده ارتش"],

            [
                "رئیس ستاد ارتش ایران","رییس ستاد ارتش ایران","فرمانده ستاد ارتش ایران","معاون هماهنگ کننده ارتش ایران",
                "معاون هماهنگ‌کننده ارتش ایران",

                "رئیس ستاد ارتش جمهوری اسلامی","رییس ستاد ارتش جمهوری اسلامی","فرمانده ستاد ارتش جمهوری اسلامی",
                "معاون هماهنگ کننده ارتش جمهوری اسلامی","معاون هماهنگ‌کننده ارتش جمهوری اسلامی"
            ]
        ],
        "must_not": [
            must_not_block,

            must_not_country_block,

            []
        ]
    },                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      

    # Person 8 - جهان شاهی
    8: {
        "must": [
            ["جهانشاهی"],

            ["جهان شاهی"],

            ["جهان‌شاهی"],

            []
        ],
        "should": [
            should_block,

            should_block,

            should_block,

            [
                "جانشین معاون ارزیابی قرارگاه خاتم الانبیا","جانشین معاون نظارت قرارگاه خاتم الانبیا",
                "جانشین معاون نظارت و ارزیابی میدانی مرکزی خاتم‌الانبیا",

                "جانشین معاون ارزیابی میدانی قرارگاه خاتم الانبیا","جانشین معاون نظارت میدانی قرارگاه خاتم الانبیا",
                "جانشین معاون نظارت و ارزیابی میدانی قرارگاه مرکزی خاتم‌الانبیا"
            ]
        ],
        "must_not": [
            must_not_block,
            
            must_not_block,

            must_not_block,

            must_not_country_block
        ]
    },

    # Person 9 - صباحی فرد
    9: {
        "must": [
            ["صباحی فرد"],

            ["صباحی‌فرد"],

            [],

            []
        ],
        "should": [
            should_block,

            should_block,

            ["فرمانده نیروی پدافند ارتش","فرمانده نیروی پدافند هوایی ارتش"],

            [
                "فرمانده نیروی پدافند ارتش ایران","فرمانده نیروی پدافند هوایی ارتش ایران",
                
                "فرمانده نیروی پدافند ارتش جمهوری اسلامی","فرمانده نیروی پدافند هوایی ارتش جمهوری اسلامی"
            ]
        ],
        "must_not": [
            must_not_block + ["جانشین فرمانده"],

            must_not_block + ["جانشین فرمانده"],

            must_not_country_block + ["جانشین فرمانده"],

            ["جانشین فرمانده"]
        ]
    },

    # Person 10 - ایرانی
    10: {
        "must": [
            ["ایرانی"],

            [],

            []
        ],
        "should": [
            ["دریادار ایرانی","امیر ایرانی"],

            ["فرمانده نیروی دریایی ارتش","فرمانده نداجا"],

            ["فرمانده نیروی دریایی ارتش ایران","فرمانده نیروی دریایی ارتش جمهوری اسلامی"]
        ],
        "must_not": [
            must_not_block,

            must_not_country_block + ["جانشین فرمانده","فرمانده نیروی دریایی ارتش شاهنشاهی"],

            ["جانشین فرمانده"]
        ]
    },

    # Person 11 - واحدی
    11: {
        "must": [
            ["واحدی"],

            [],

            []
        ],
        "should": [
            should_block,

            ["فرمانده نیروی هوایی ارتش","فرمانده نهاجا"],

            ["فرمانده نیروی هوایی ارتش ایران","فرمانده نیروی هوایی ارتش جمهوری اسلامی"]
        ],
        "must_not": [
            must_not_block + ["خدا","رویکرد واحدی","واحد","اسلامی واحدی","هیچ واحدی","ارتش واحدی","هدف واحدی","پیام واحدی","صدای واحدی","نگاه واحدی"],
            
            must_not_country_block + ["جانشین فرمانده","فرمانده نیروی هوایی ارتش شاهنشاهی"],

            ["جانشین فرمانده"]
        ]
    },

    # Person 12 - پوردستان
    12: {
        "must": [
            ["پوردستان"],

            [],

            []
        ],
        "should": [
            should_block,

            ["رئیس مرکز مطالعات و تحقیقات راهبردی ارتش","رییس مرکز مطالعات و تحقیقات راهبردی ارتش"],

            [
                "رئیس مرکز مطالعات و تحقیقات راهبردی ارتش ایران","رییس مرکز مطالعات و تحقیقات راهبردی ارتش ایران",

                "رئیس مرکز مطالعات و تحقیقات راهبردی ارتش جمهوری اسلامی","رییس مرکز مطالعات و تحقیقات راهبردی ارتش جمهوری اسلامی"
            ]
        ],
        "must_not": [
            must_not_block,

            must_not_country_block,

            []
        ]           
    },

    # Person 13 - آشتیانی
    13: {
        "must": [
            ["آشتیانی"],

            [],
            
            []
        ],
        "should": [
            should_block,

            [
                "جانشین رییس ستاد‌ کل","جانشین رئیس ستاد‌ کل","جانشین فرمانده ستاد کل",
                "نایب رییس ستاد کل","نایب رئیس ستاد کل","نائب رییس ستاد کل", "نائب رئیس ستاد کل"
            ],

            [
                "جانشین رئیس ستاد کل نیروهای مسلح ایران","جانشین رییس ستاد کل نیروهای مسلح ایران","جانشین رییس ستاد کل ایران","جانشین رئیس ستاد کل ایران",
                "نایب رئیس ستاد کل نیروهای مسلح ایران","نایب رییس ستاد کل نیروهای مسلح ایران","نایب رییس ستاد کل ایران","نایب رئیس ستاد کل ایران",
                "نائب رئیس ستاد کل نیروهای مسلح ایران","نائب رییس ستاد کل نیروهای مسلح ایران","نائب رییس ستاد کل ایران","نائب رئیس ستاد کل ایران",
                "جانشین فرمانده ستاد کل نیروهای مسلح ایران","جانشین فرمانده ستاد کل ایران",

                "جانشین رئیس ستاد کل نیروهای مسلح جمهوری اسلامی","جانشین رییس ستاد کل نیروهای مسلح جمهوری اسلامی","جانشین رییس ستاد کل جمهوری اسلامی",
                "جانشین رئیس ستاد کل جمهوری اسلامی","جانشین فرمانده ستاد کل نیروهای مسلح جمهوری اسلامی","جانشین فرمانده ستاد کل جمهوری اسلامی",
                "نایب رئیس ستاد کل نیروهای مسلح جمهوری اسلامی","نایب رییس ستاد کل نیروهای مسلح جمهوری اسلامی","نایب رییس ستاد کل جمهوری اسلامی",
                "نایب رئیس ستاد کل جمهوری اسلامی",
                "نائب رئیس ستاد کل نیروهای مسلح جمهوری اسلامی","نائب رییس ستاد کل نیروهای مسلح جمهوری اسلامی","نائب رییس ستاد کل جمهوری اسلامی",
                "نائب رئیس ستاد کل جمهوری اسلامی"
            ]
        ],
        "must_not": [
            must_not_block,

            must_not_country_block,

            []
        ]
    },

    # Person 14 - اکرمی نیا
    14: {
        "must": [
            ["اکرمی نیا"],

            ["اکرمی‌نیا"],

            [],

            []
        ],
        "should": [
            should_block,

            should_block,

            ["معاون هماهنگ کننده سازمان عقیدتی سیاسی ارتش"],

            ["معاون هماهنگ کننده سازمان عقیدتی سیاسی ارتش ایران","معاون هماهنگ کننده سازمان عقیدتی سیاسی ارتش جمهوری اسلامی"]
        ],
        "must_not": [
            must_not_block,

            must_not_block,

            must_not_country_block,

            []
        ]
    }
}