from keywords.routing_rules import must_not_block
from keywords.routing_rules import must_not_country_block


topics = {

    # Topic 1 - یارانه
    1: {
        "must": [
            ["ارتش"]
        ], 
        "should": [
            ["دهک","یارانه","کالابرگ","سبد معیشت","کمک معیشت","سبد کالا","کمک هزینه","معیشتی"]
        ],
        "must_not": [
            must_not_country_block
        ]
    },

    # Topic 2 - پاداش
    2: {
        "must": [
            ["پاداش"]
        ],
        "should": [
            ["ارتش"]
        ],
        "must_not": [
            []
        ]
    },

    # Topic 3 - اتکا و سبد کالا
    3: {
        "must": [
            ["اتکا"]
        ],
        "should": [
            [
                "کالا","گران","گرون","معیشتی","حمایت اقتصادی","سبد غذایی","تخفیف","کارت حکمت","کارت اعتباری", 
                "کارت خرید","کوپن","بن خرید","کالابرگ","یارانه","سبد حمایتی","کالاهای اساسی","مواد غذایی","اجناس",
                "خواربار","مایحتاج","کالاهای مصرفی"
            ]
        ],
        "must_not": [
            must_not_country_block
        ]
    },

    # Topic 4 - خدمات درمانی
    4: {
        "must": [
            ["ارتش"]
        ],
        "should": [
            ["خدمات درمانی", "بیمه", "خدمات پزشکی", "درمانگاه", "بیمارستان ", "خدمات بهداشتی", "پوشش بیمه‌ای", "پزشک", "داروخانه", "خدمات اورژانس",
            "مراقبت‌های پزشکی", "مراقبت‌ های پزشکی", "سلامت پرسنل", "خدمات توانبخشی", "بیمه تکمیلی", "معاینات دوره‌ای", "خدمات روانشناسی"]
        ],
        "must_not": [
            ["سپاه", "بسیج", "ناجا", "فراجا", "کارمندان دولت", "کارگران", "معلمان", "پرستاران", "بازنشستگان کشوری", "بازنشستگان تامین اجتماعی",
            "کادر درمان غیرنظامی"]
        ]
    },

    # Topic 5 - ارتباط فرماندهان با کارکنان
    5: {
        "must": [
            ["ارتش", "فرمانده"]
        ],
        "should": [
            ["کارکنان", "تعامل", "مکاتبه", "افسران", "یگان", "پرسنل", "مدیریت", "نزاجا", "نهاجا", "نداجا", "جلسه", "جلسات", "بازخورد", "ارتباط", 
            "مشاوره", "انضباط"]
        ],
        "must_not": [
            ["سپاه", "بسیج", "ناجا", "فراجا", "کارمندان دولت", "کارگران", "معلمان", "پرستاران", "بازنشستگان کشوری", "بازنشستگان تامین اجتماعی",
            "کادر درمان غیرنظامی"]
        ]
    },

    # Topic 6 - شهرک‌های سازمانی
    6: {
        "must": [
            ["شهرک"]
        ], 
        "should": [
            ["شهید فلاحی", "لویزان یک", "لویزان 1", "لویزان دو", "لویزان 2", "شهید هاشمی نژاد", "لویزان سه", "لویزان 3", "قمر بنی هاشم", "قمر بنی‌هاشم", 
            "توحید", "امیرالمومنین", "امیرالمؤمنین", "قصر فیروزه یک", "قصر فیروزه 1", "قصر فیروزه دو", "قصر فیروزه 2", "شهید قرنی", "شهرک آسمان", 
            "شهرک مهرآباد", "شهید نامجو", "کوهک نداجا"]
        ], 
        "must_not": [
            []
        ]
    },

    # Topic 7 - حق شیر
    7: {
        "must": [
            ["ارتش", "حق شیر"]
        ],
        "should": [
            []
        ],
        "must_not": [
            []
        ]
    },

    # Topic 8 - مدرک تحصیلی
    8: {
        "must": [
            ["ارتش"]
        ],
        "should": [
            ["مدرک", "تحصیل"]
        ],
        "must_not": [
            []
        ]
    },

    # Topic 9 - بازنشستگان و ایثارگران   
    9: {
        "must": [
            ["ارتش"]
        ], 
        "should": [
            ["بازنشستگان", "ایثارگران", "پاداش بازنشستگی", "سنوات بازنشستگی"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Topic 10 - انتقالات نزاجا
    10: {
        "must": [
            ["نزاجا"]
        ],
        "should": [
            ["انتقالات", "انتقال", "جابجایی", "تغییر محل خدمت", "انتقالی"]
        ],
        "must_not": [
            []
        ]
    },

    # Topic 11 - سامانه سپهر 
    11: {
        "must": [
            ["ارتش"]
        ],
        "should": [
            ["سپهر"]
        ],
        "must_not": [
            ["سپاه", "بسیج", "ناجا", "فراجا", "کارمندان دولت", "کارگران", "معلمان", "آموزش و پرورش", "پرستاران", "بازنشستگان کشوری", 
            "بازنشستگان تامین اجتماعی", "کادر درمان", "بانک", "موسسه مالی", "صادرات"]
        ]
    },

    # Topic 12 - آوند کارت 
    12: {
        "must": [
            ["آوند"]
        ],
        "should": [
            ["ارتش","تعاونی","فروشگاه","فروشگاه‌های","کالا","کالاهای","خدمات رفاهی","کارت","تخفیف","رستوران"]
        ],
        "must_not": [
            []
        ]
    },

    # Topic 13 - اماکن رفاهی 
    13: {
        "must": [
            []
        ],
        "should": [
            ["مهمانسرای گل یاس", "مهمانسرای 22 بهمن", "رستوران هفت آسمان", "رستوران فود تایم", "تالار و رستوران شب های سفید", "تالار و رستوران شب‌های سفید",
                    "تالار پرواز", "سفره خانه سنتی", "سفره‌خانه سنتی", "فست فود آهورا", "کافه جگرکی یاسین", "فست فود پیتزا هات", "کافه فست فود 88", "رستوران پرواز اصفهان",
                    "کافه رستوران مگنولیا", "رستوران شکوفه", "آتا سوخاری", "رستوران مهستان", "رستوران 777", "رستوران کلبه آبشار", "سفره خانه سندباد", "سفره‌خانه سندباد",
                    "مهمانسرای پدافند", "رستوران رضاگله", "مجموعه فرهنگی تفریحی سردار شهید حاج احمد کاظمی", "پیتزا آزادی", "رستوران نگین سلدوز", "رستوران شانلی",
                    "رستوران آرکا", "غذاخوری ترک نفیس", "فست فود شاهد", "تالار نور", "رستوران شمشیری", "بناب کبابی بهنام", "رستوران ارشد داداش", "فست فود هایزن سوخاری",
                    "کافه سنتی پایگاه", "فست فود و پیتزا فروشی باران پایگاه", "تالار و رستوران فجر", "هتل ستاره", "رستوران خانه ناهار و شام", "کافه رستوران تیان",
                    "فست فود شاکر", "رستوران اقیانوس", "رستوران بهشت", "مجتمع گردشگری تخت طاووس", "رستوران ماهور", "رستوران زیتون", "رستوران طلائیه سپاه", "رستوران مهدا",
                    "رستوران الماس", "فودلند الماس", "مهمانسرای فدک", "تالار و رستوران شهدای ارتش خوی", "رستوران حاج فیروز", "رستوران و کترینگ مامان پز", "رستوران بلوط",
                    "رستوران گل نرگس", "مجتمع فرهنگی و رفاهی طلائیه", "کبابی احسان", "رستوران کبابسرای امید", "رستوران بیرون بر آفتاب", "رستوران بیرون‌بر آفتاب", 
                    "مجتمع گردشگری دریادلان", "کبابی میرشکاری", "مهمانسرای جنوب", "سیار و ثابت Pos تالار صدف", "رستوران مروارید", "باغ رستوران آسمان", 
                    "رستوران بیرون بر گردو", "مجموعه بیرون بر و کترینگ ته دیگ", "خانه معلم شماره یک", "رستوران و تالار مروارید", "رستوران و تالار سپیدار", 
                    "تالار سروناز", "رستوران سنتی سیمرغ", "تالار و رستوران آسمان", "رستوران گلها", "تالار زیتون", "فست فود پاپریکا", "رستوران آبشار", 
                    "تالار گل نرگس ثابت", "تالار گل نرگس سیار", "کترینگ آشپزباشی", "رستوران گل نرگس", "مجموعه آفتاب", "رستوران پارک شادی فلاحی", "فست فود حیدری",
                    "کترینگ آوریز", "مسترفود", "تالار و رستوران نگین هوانیروز", "پیتزا و ساندویچ زیتون", "فست فود گاردن", "باغ بنانیه", "تالار چشم انداز", 
                    "فست فود کومو", "تالار عطر یاس", "سیار Pos مجموعه تفریحی رستورانی نارنج", "مجموعه تفریحی رستورانی نارنج ثابت",  "تالار گلستان", 
                    "رستوران پرواز", "فست فود پرواز", "باغ رستوران بهشت پنهان", "رستوران باغچه پردیس", "رستوران فودکورت نور", "کترینگ تشریفات ایرانیان",
                    "رستوران روژگل", "فست فود پاپریکا قصر 2", "رستوران ترنج", "یاس سفید", "مجتمع خدمات رفاهی شهید قرنی", "کافه فست فود پرواز", "تالار آفتاب دانشگاه", "رستوران ارغوان",
                    "فست فود کاپیتان", "مجتمع رستوران و تالار پذیرایی صدف", "کبابی آجودانیه", "رستوران سنتی عقاب طلایی", "کافه رستوران کدبانو", "مجموعه تالار باغ بهشت",
                    "رستوران ارم", "مهمانسرای میلاد", "بریانی های یو", "رستوران و تالار فرهنگیان", "رستوران سلجوقی", "رستوران پردیس", "مجتمع غذایی گلاویژ", "تالار و مهمانسرای کوثر",
                    "پیتزا تک", "رستوران دستپخت", "پیتزا اریکه", "رستوران ناهار خوران", "مهمانسرای تیپ 177", "رستوران صابری", "رستوران برکت", "رستوران امیرکبیر", "رستوران میزبان",
                    "رستوران بهشت", "غذای آماده فنایی", "پیتزا شام‌گاه", "پیتزا شام گاه", "امیر جوجه", "هتل 19 بهمن", "هتل شهید محمدی", "مهمانسرای زیتون", "مجموعه فرهنگی رفاهی میلاد",
                    "مهمانسرای ثامن الائمه", "رستوران ثامن الحجج پدافند ثابت و سیار", "مجتمع فرهنگی زیارتی الغدیر", "مهمانسرای امام علی (ع)", "هتل شهدا", 
                    "مجتمع رفاهی آموزشی تفریحی قرارگاه", "مجموعه فرهنگی رفاهی دریادلان", "مجتمع فرهنگی فجر انقلاب", "مهمانسرای جواد الائمه", "مجموعه فرهنگی رفاهی ثامن الحجج", 
                    "مجموعه فرهنگی رفاهی شهید دباغ دروازه ای","مجموعه فرهنگی رفاهی شهید دباغ دروازه‌ای", "آشپرخانه و رستوران کوهشار", "رستوران شبدیز", "فست فود دنج", 
                    "رستوران سران", "کترینگ و آشپرخانه باقرالعلوم", "مجموعه مهمانسرای مهر ولایت", "مجتمع اقامتی فرهنگی امام رضا", "رستوران دولپی", "فست فود پیتزا کندز", 
                    "رستوران لاله سپاه", "هتل آسمان", "کافه رستوران سیسوخان", "تالار شهید منصور ستاری", "رستوران کباب ساطوری بناب", "رستوران متین", "مجموعه غذایی سفیر", 
                    "مجموعه غذایی ریحون", "رستوران سوم خرداد", "فروشگاه شمس", "باغ رستوران آلونک مال", "کافه رستوران راز", "باغ رستوران فلاحت", "تالار سیمرغ", 
                    "کافه فست فود رستوران نیاز", "رستوران لشکر", "رستوران وارگه", "رستوران الماس شرق", "کافه رستوران سپیدار", "رستوران نیاتوس", "رستوران زیتون", "تالار کوثر", 
                    "هایپر و رستوران سفره ایرانی", "مجتمع فرهنگی میلاد نور", "رستوران دارچین", "شهر سیب زمینی", "مجتمع رستورانی و فروشگاهی جزیره", "باشگاه غذاخوری پرستو", 
                    "مجموعه تفریحی و گردشگری فانوس شب", "باغ رستوران حامی", "رستوران کوثر", "تک vip رستوران کباب", "رستوران ساحلی صدف", "رستوران هخامنش", 
                    "مهمانسرای شهید جاودانیان", "مهمانسرای عفیف آباد", "مهمانسرای سه شاخه شیراز", "مهمانسرای سه‌شاخه شیراز", "مهمانسرای 29 فرودین", "فست فودی آپارتمانی", 
                    "تالار پارس", "مهمانسرای انقلاب", "تالار سبوی عشق", "رستوران سنتی باغ تخت", "مجموعه غذایی امیران", "مجموعه غذایی امیران (مهدا)", "مجموعه غذایی امیران شعبه 1", 
                    "فست فود و پاچینی سوینج", "بیرون بر ته چین", "بیرون بر ته‌چین", "مجموعه رفاهی مقدم", "فست فود سور", "رستوران خلیج فارس", "رستوران گلپایگانی", 
                    "فست فود ایران زمین", "رستوران آرمانی", "رستوران تهران قدیم", "رستوران شقایق", "فست فود سوخاری فیدل", "رستوران خضراء", "زائرسرای مهر ولایت", 
                    "زائر سرای مهر ولایت", "رستوران عالیجناب", "کافه رستوران مایسالانژ", "رستوران و سالن مجلل هزار و یک شب", "باغ رستوران ستاره شهر", "رستوران و تهیه غذای سقز", 
                    "رستوران رومانو", "رستوران بازار", "رستوران گلسرخ", "رستوران سنتی گلستان", "رستوران صدف", "رستوران سنتی فانوس", "پیتزا فروشی زاپاتا", "رستوران مادر ایرونی", 
                    "رستوران نیما", "رستوران سرآشپز", "رستوران یاس", "رستوران نقشین", "رستوران غدیر", "رستوران افرا", "رستوران ترنج", "رستوران توشمالانی", "رستوران وزراء", "رستوران جم",
                    "تالار رستوران کوثر", "هتل رستوران عجم", "هتل رستوران کانیار", "رستوران چلو گوشت برادران کریم", "رستوران چلوگوشت برادران کریم",
                    "رستوران و فست فود امیر", "رستوران مجید", "هتل سبلان انزلی", "رستوران ساحلی میلاد", "رستوران اداره بندر", "مهمانسرای پامچال انزلی", "مجموغه رستوران ملوان",
                    "استراحتگاه انزلی", "مجموعه باغ رستوران سمیعی", "مجموعه کافه رستوران میم", "مجموعه رستورانی میزبان نمونه", "مهمانسرای حسود رود انزلی",
                    "رستوران و فست فود کاپیتان", "رستوران آریا", "رستوران تخت جمشید", "رستوران لورنزو", "رستوران ته چین طلایی", " رستوران رضایی", "رستوران عباسی", 
                    "فست فود زعفران طلایی", "رستوران من", "رستوران دشت بهشت", "رستوران پدر خوب", "رستوران دلفین", "رستوران دلکده", "مجتمع آموزشی عملیاتی شهید ستاری", "رستوران دریا",
                    "مجتمع پذیرایی و تفریحی وارش", "کافه فست فود ساحل", "پیتزا پیندر", "مهمانسرای خزرآباد هوانیروز", "مهمانسرای خزرآباد نزاجا", "مهمانسرای گهرباران نزاجا",
                    "اردوگاه شهدای آجا", "رستوران آکواریوم", "فست فود آسمون", "رستوران سرسبز", "مجتمع تفریحی شهید خلعتبری", "فست فود لند", "رستوران بین المللی خواجوی",
                    "مهمانسرای شهید مطهری", "مهمانسرای شهید مطهری (سیسنگان)", "رستوران مهمانسرای موج" , "اردوگاه شهید رسولی نوشهر", "اردوگاه شهید رسولی نوشهر (گل نرگس)",
                    "کافه تریای ساحلی", "مجتمع لاله", "کافه و رستوران سه سوت", "فست فود راما", "کافه فست فود حس ناب", "تالار دریا", "رستوران ستاره", "رستوران فانوس",
                    "مجموعه غذایی عمارت", "فست فودی قائم", "رستوران هتل پرواز", "مجتمع شهید چمران بندر عباس", "رستوران مهر و ماه", "رستوران مهروماه", "هتل ستاره طلایی کیش", 
                    "فست فود هام هام", "تالار آفتاب", "سفره خانه سنتی شبستان", "فست فود دوستی", "تالار پذیرایی وحدت", "رستوران مادر خوب", "رستوران هانی", "رستوران دربند"
            ]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   
        ],
        "must_not": [
            []
        ]
    },

    # Topic 14 - وام 
    14: {
        "must": [
            ["ارتش"]
        ],
        "should": [
            ["وام", "وام مسکن", "وام ضروری", "وام خرید کالا", "وام رفاهی", "وام کارکنان", "وام بازنشستگان", "وام قرض‌الحسنه", "وام خرید خودرو", "وام ساخت مسکن",
            "وام خرید خانه", "وام خرید زمین", "وام خرید لوازم خانگی", "اقساط وام", "بازپرداخت وام", "وام بنیاد تعاون", "وام بتاجا", "وام مسکن", 
            "وام صندوق پس‌انداز"]
        ],
        "must_not": [
            []
        ]
    },

    # Topic 15 - بتاجا 
    15: {
        "must": [
            []
        ],
        "should": [
            ["بنیاد تعاون ارتش", "پروژه‌ مسکن ارتش", "بتاجا"]
        ],
        "must_not": [
            []
        ]
    },

    # Topic 16 - حقوق و معیشت 
    16: {
        "must": [
            ["ارتش"]
        ],
        "should": [
            ["حقوق", "حقوقی", "معیشت", "معوقات", "رفاه نظامیان", "مزایا", "مشکلات معیشتی", "سطح زندگی", "هزینه‌های زندگی"]
        ],
        "must_not": [
            []
        ]
    },

    # Topic 17 - تنش‌های نظامی ایران
    17: {
        "must": [
            ["ایران"]
        ], 
        "should": [
            ["ارتش", "نظامی", "دفاع", "جنگ", "شهدای", "شهیدان", "سرباز", "سربازان", "نیرو", "نیروها", "نیروهای", "فرمانده", "فرماندهان"]
        ], 
        "must_not": [
            []
        ]
    },

    # Topic 18 - پدافند هوایی کشور
    18: {
        "must": [
            ["پدافند"]
        ], 
        "should": [
            ["هوایی", "ارتش", "جمهوری اسلامی", "ایران", "آماده‌باش", "فرمانده", "قرارگاه", "کشور", "رهبری", "افسران"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Topic 19 - حواشی ترور
    19: {
        "must": [
            ["ترور"]
        ], 
        "should": [
            ["ایران", "شخصیت", "جمهوری اسلامی", "جنگ", "انتحاری", "فرمانده", "قرارگاه", "کشور", "ارتش", "انفجار", "حواشی"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Topic 20 - حواشی جاسوسی
    20: {
        "must": [
            ["جاسوسی"]
        ], 
        "should": [
            ["ایران", "اطلاعات", "امنیت", "جمهوری اسلامی", "حفاظت", "ردیابی", "نفوذ", "کشور", "ارتش", "حواشی"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Topic 21 - بانک سپه
    21: {
        "must": [
            ["سپه"]
        ], 
        "should": [
            ["ایران","بانک","جمهوری اسلامی","امنیت","هک","کاربر","کاربران","نظامیان","نظامی","حقوق","ارتش",
            "سپاه","انقلاب","رهبری","موشک","تحریم","جنگ","تهاجم","دفاع","سرباز","مرز","پلیس","امنیت ملی","جاسوسی",
            "اطلاعات""نیروهای مسلح","پاسداران","تهدید","تروریسم","ضدجاسوسی","حمله سایبری","خرابکاری","نفوذ","حریم خصوصی"]
        ],
        "must_not": [
            ["بزرگراه","خیابان","میدان","بلوار","اتوبان","بیمارستان","کوچه","مدرسه","چهار راه","چهار‌راه","دانشگاه","کمربندی","ورزشگاه","ترمینال"]
        ]
    },

    # Topic 22 - جنگنده‌ها 
    22: {
        "must": [
            ["جنگنده"]
        ], 
        "should": [
            ["ایران", "ایرانی", "ارتش", "جمهوری اسلامی", "حمله", "عملیات", "خلبان", "دفاع", "F14", "f14", "f 14", "F 14", "اف ۱۴", "اف۱۴", "اف 14", "اف14"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Topic 23 - پهپاد 
    23: {
        "must": [
            ["پهپاد"]
        ], 
        "should": [
            ["ایران", "ایرانی", "فناوری", "ارتش", "جمهوری اسلامی", "حمله", "فروند", "عملیات"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Topic 24 - موشک 
    24: {
        "must": [
            ["موشک"]
        ], 
        "should": [
            ["ایران", "ایرانی", "فناوری", "ارتش", "جمهوری اسلامی", "حمله", "فروند", "عملیات"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Topic 25 - ماهواره 
    25: {
        "must": [
            ["ماهواره"]
        ], 
        "should": [
            ["ایران", "ایرانی", "فناوری", "ارتش", "جمهوری اسلامی"]
        ], 
        "must_not": [
            must_not_block
        ]
    },
    
    # Topic 26 - کشتی و ناو 
    26: {
        "must": [
            ["ناو"]
        ], 
        "should": [
            ["ناوبندر مکران", "ناوگروه ۸۶", "ناوچه کنارک", "ناوشکن البرز", "جنگی", "جنگ", "کشتی", "ارتش", "ایران", "دفاع", "دریایی", "جمهوری اسلامی"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Topic 27 - رزمایش‌های ارتش
    27: {
        "must": [
            ["رزمایش", "ارتش"]
        ], 
        "should": [
            ["جمهوری اسلامی", "ایران", "ذوالفقار", "فاتحان خیبر", "فاتحان‌خیبر", "ارتش"]
        ],  # duplicate ارتش to make the "minimum_should_match: 1" always true
        "must_not": [
            must_not_block
        ]
    },

    # Topic 28 - تاسیسات هسته‌ای   
    28: {
        "must": [
            ["ایران"]
        ], 
        "should": [
            ["هسته‌ای", "هسته ای"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Topic 29 - جزایر مورد مناقشه   
    29: {
        "must": [
            ["جزایر", "مناقشه"]
        ], 
        "should": [
            ["ایران", "امارات", "ابوموسی", "تنب بزرگ", "تنب کوچک"]
        ], 
        "must_not": [
            []
        ]
    },

    # Topic 30 - تنگه هرمز 
    30: {
        "must": [
            []
        ], 
        "should": [
            ["تنگه هرمز"]
        ], 
        "must_not": [
            []
        ]
    },

    # Topic 31 - میدان گازی آرش  
    31: {
        "must": [
            []
        ], 
        "should": [
            ["گازی آرش"]
        ], 
        "must_not": [
            []
        ]
    },

    # Topic 32 - کریدور زنگزور
    32: {
        "must": [
            []
        ], 
        "should": [
            ["کریدور زنگزور"]
        ], 
        "must_not": [
            []
        ]
    },

    # Topic 33 - تنش‌های پاکستان   
    33: {
        "must": [
            ["پاکستان"]
        ], 
        "should": [
            ["ایران"]
        ],
        "must_not": [
            ["بسکتبال", "والیبال", "فوتبال", "ورزش", "مسابقه", "رقابت"]
        ]
    },

    # Topic 34 - تنش‌های افغانستان   
    34: {
        "must": [
            ["افغانستان"]
        ], 
        "should": [
            ["ایران"]
        ],
        "must_not": [
            ["بسکتبال", "والیبال", "فوتبال", "ورزش", "مسابقه", "رقابت"]
        ]
    },

    # Topic 35 - تنش‌های آذربایجان   
    35: {
        "must": [
            ["آذربایجان"]
        ], 
        "should": [
            ["ایران"]
        ],
        "must_not": [
            ["بسکتبال", "والیبال", "فوتبال", "ورزش", "مسابقه", "رقابت"]
        ]
    },

    # Topic 36 - تنش‌های ترکیه   
    36: {
        "must": [
            ["ترکیه"]
        ], 
        "should": [
            ["ایران"]
        ],
        "must_not": [
            ["بسکتبال", "والیبال", "فوتبال", "ورزش", "مسابقه", "رقابت"]
        ]
    },

    # Topic 37 - تنش‌های لبنان   
    37: {
        "must": [
            ["لبنان"]
        ], 
        "should": [
            ["ایران"]
        ],
        "must_not": [
            ["بسکتبال", "والیبال", "فوتبال", "ورزش", "مسابقه", "رقابت"]
        ]
    },

    # Topic 38 - تنش‌های اسرائیل   
    38: {
        "must": [
            ["ایران"]
        ], 
        "should": [
            ["اسرائیل", "اسراییل"]
        ],
        "must_not": [
            ["بسکتبال", "والیبال", "فوتبال", "ورزش", "مسابقه", "رقابت"]
        ]
    },

    # Topic 39 - حماس    
    39: {
        "must": [
            ["حماس"]
        ], 
        "should": [
            ["ایران"]
        ], 
        "must_not": [
            ["بسکتبال", "والیبال", "فوتبال", "ورزش", "مسابقه", "رقابت"]
        ]
    },

    # Topic 40 - اظهارات مجلس    
    40: {
        "must": [
            ["مجلس"]
        ], 
        "should": [
            ["ارتش"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Topic 41 - اظهارات سپاه
    41: {
        "must": [
            ["سپاه"]
        ], 
        "should": [
            ["ارتش"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Topic 42 - حواشی آب و برق   
    42: {
        "must": [
            ["قطعی"]
        ], 
        "should": [
            ["آب", "برق"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Topic 43 - گرانی و تورم  
    43: {
        "must": [
            []
        ], 
        "should": [
            ["تورم", "گرانی"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Topic 44 - آتش‌سوزی   
    44: {
        "must": [
            []
        ], 
        "should": [
            ["آتش سوزی", "آتش‌سوزی"]
        ], 
        "must_not": [
            must_not_block
        ]
    },

    # Topic 45 - پهپاد آرش
    45: {
        "must": [
            []
        ], 
        "should": [
            ["پهپاد آرش", "پهپاد ارش", "Arash Drone", "Arash drone", "Arash 1", "Arash 2", "Arash-1", "Arash-2"]
        ], 
        "must_not": [
            []
        ]
    }
}