should_block = [
    # Military ranks and command titles
    "امیر","نزاجا","نپاجا","نهاجا","نداجا","اجا","آجا","سرتیپ","سرتیپ ستاد","سرتیپ دوم","سرلشکر","سرلشگر","تیمسار","دریادار","ناخدا",
    "فرمانده","جانشین فرمانده","فرمانده کل ارتش","فرمانده نیروی زمینی","فرمانده نیروی دریایی","فرمانده نیروی هوایی","سپهبد","شهید",
    "فرمانده پدافند هوایی","رئیس ستاد","جانشین رئیس ستاد","معاون عملیات","معاون هماهنگ‌ کننده", "رئیس عقیدتی سیاسی","سرباز","شهادت",
    "ارتش","جانشین فرمانده ارتش امیر","جانشین خاتم","جانشین قرارگاه خاتم","نیرو","نیروی","خلبان",

    # Leader and concepts of supreme command
    "رهبر ایران","رهبر جمهوری اسلامی","رهبر معظم انقلاب","خامنه‌ای","خامنه ای","فرمانده کل قوا",
    "ولایت","ولایی","فرماندهی معظم کل قوا","رهبری جمهوری اسلامی","رهبری ایران",

    # Operations, drills, and war-related terms
    "رزمایش","مانور","نظامی","عملیات","آمادگی رزمی","آمادگی کامل ارتش","دفاعی","دفاع","شکست",
    "توان رزمی","قدرت بازدارندگی","تحرکات دشمن","مقابله با تهدید","تهدید","حمله","مقابله با تهدیدات","تقویت مرزها","امنیت مرزها",
    "جنگ","درگیری","نبرد","تهاجم","پدافند","ضربت","تله انفجاری","کمین","تحرکات مرزی",

    # Equipment, weapons, and defense systems
    "تجهیزات پیشرفته","سلاح‌های جدید","سامانه موشکی","خودرو زرهی","موشک","پهپاد","تانک",
    "نفربر","توپخانه","توپ","توپخانه متحرک","هواپیما جنگی","جنگنده","سوخو","میگ","زیردریایی",
    "ناوشکن","ناو","قایق تندرو","سیستم پدافند هوایی","رادار آرایه فازی",
    "اف-4","اف-5","اف-14","اف-15","اف-16","اف-18","اف-22","اف-35",
    "اف-۴","اف-۵","اف-۱۴","اف-۱۵","اف-۱۶","اف-۱۸","اف-۲۲","اف-۳۵",
    
    # Visits, speeches, ceremonies
    "بازدید","سخنرانی","پیام تبریک","پیام تسلیت","گفتگو","مصاحبه","نشست",
    "جلسه","کنفرانس","همایش","اجلاسیه","رژه",

    # Bases, headquarters, universities, and training centers
    "پایگاه","پادگان","قرارگاه","مرکز آموزش","دافوس",

    # Positive concepts
    "مقتدر","قوی","شجاع","باهوش","باتجربه","حرفه‌ای","دلسوز","وفادار","ایثارگر",
    "فداکار","خستگی‌ناپذیر","شجاعت","اقتدار","استراتژیک","سلحشور","امانتدار",

    # Negative concepts
    "بی‌کفایت","ناکارآمد","بی‌عرضه","نالایق","خائن","ترسو","فاسد","بی‌مسئولیت","بی‌لیاقت","سوءمدیریت","ضعیف",
    "کم‌کاری","دروغگو","بی‌غیرت","نفوذی","فرار","تروریست","باند"
]

must_not_block = [

    # Places
    "بزرگراه","خیابان","میدان","بلوار","اتوبان","بیمارستان","کوچه","مدرسه","دانشگاه","چهار راه","چهار‌راه",
    "کمربندی","بهزیستی","ورزشگاه","ترمینال","فرودگاه","مترو","پارک","کتابخانه","ایستگاه","نانوایی",
    "مجتمع","بازار","پاساژ","مسجد","امامزاده","زیارت","زیارتگاه","پل","خیابان اصلی","موزه","گمرک",
    "معدن","سیلو","سیلوها","سیلوهای","سیلوهایی","شعبه","صرافی","کتابخونه","موکب","مسکن","شهرک","تکیه",

    # Sports
    "استقلال","استقلالی","پرسپولیس","پرسپولیسی","تراکتور","داور","داوری","کمیته","بیرانوند","سانتر",
    "لیگ","شوت","دروازه","گل","سرخ","استوک","مربی","یورو","لیگ قهرمانان","توپ","گلر","ورزشکار","سوت",
    "پنالتی","باشگاه","آفساید","افساید","لنگی","لنگ","کیسه","فایتر","لژیونر","تنیس",

    # Politics
    "دیپلمات","اصلاحات","شورای شهر","مالیات","ثبت احوال","کمیسیون","اقتصادی","اقتصاد","حسابرس","شهردار",
    "دیوان محاسبات","مدیرعامل","مددکاران","اصلاح طلب","طلبان","اصلاحطلبان","سیاستمدار","انتخابات","نامزد",
    "میرحسین","کروبی","خاتمی","احمدی نژاد","هاشمی","رفسنجانی","مادورو","اپشتاین","کارتر","پارلمان",
    "برجام","جاسوسی","توافق","نیابتی","تحریم","ریاست جمهوری","کابینه","سفیر","مجلس","شورای نگهبان",
    "قانون اساسی","دلار","غنی‌سازی","غنی‌ سازی","حماس","حزب الله","حزب‌الله","جولانی","کانال","رایزن","روس",
    "حجت الاسلام","حجت‌الاسلام","حزب توده","دولت","بخشدار","فرماندار","هواشناسی","حاکمان","امیرکبیر","امیر کبیر",
    "سازمان ملل","جاسوس","جنبش","مشروطه‌خواهی","مشروطه ‌خواهی","فرمانداری","شهرسازی","شهرداری","حکمرانی",

    # Names
    "زینب","جواد","مصطفی","نسترن","مجید","پژمان","فرید","سیدحسین","سید حسین","علیرضا","مهدی","بابک","محمود","ماریا","وحید",
    "مینا","امید","مهران","نیلوفر","میلاد","هاجر","رامین","مریم","کمیل","محمد","حسین","بیتا","پیمان","صادق","جعفر","نادر",
    "جلال","احمد","حمزه","آرمان","هومن","شهداد","فخرالدین","نظام‌الدین","غلام","کاظم","فتحعلی","شایان","یوسف","پروین",
    "یاسر","سهیل","سامان","مهسا","سارا","نگین","زهرا","سمیرا","فرزاد","کاوه","حاجی‌زاده","حاجی زاده","امیرعلی","امیر علی",
    "ابوعبیده","حوثی","حوثی‌ها","حوثی‌های","فرامرز","سلیمانی","عزالدین","الحداد","آرمین","محمدرضا","حاتمی کیا","حاتمی‌کیا",
    "یاسین","میثم","علی‌محمد","اسدالله","فرزانه","سیدمحمد","سید محمد","سیدمجتبی","سید مجتبی","سحر","روح‌الله","بهزاد","شاپور",
    "روح‌ الله","روح‌اللّه","روح‌ اللّه","سیدکاظم","سید کاظم","بیژن","یاسمن","سیده‌آمنه","سیده آمنه","نژادیان","سیدهاشم","سید هاشم",
    "محمدحسین","محمد حسین","زامیر","حمید","واعظ","عیسی","حاج","حاجی","امین","سیدهادی","سید هادی","هادی","نوشین","ابوالفضل",
    "شامراد","آرش","ارش","آزیتا","اردوان","لیلا","فریبرز","فیروزه","حمداله","ارشیا","خسرو","سپهر","اولعزیز","رها","رضا",
    "طاهر","هلیلان","داود","داوود","حیات‌الله","حیات‌ الله","حیات‌اللّه","حیات‌اللّه","محمدباقر","محمد باقر","مطهره","طیما",
    "پریسا","محسن","مرتضی","سبحان","سعید","رسول","نسب","فرامز","اردشیر","مهرداد","افشین","زهره","نیکان","میرشمس","نهال",
    "بسطامی","ملک_الشعرای_بهار","ایرج","یلدا","شاهرخ","شهنام","آرشام","ابوعلی","مختار","بهرام","ناخدا حیدری","نورالدین",
    "آریان","گوگوش","کیارش","خالد","صلابت حیدری","مجتبی","مجتبا","اسماعیل","سیداسماعیل","سید اسماعیل","رشید","پیت هگستث",
    "میرحمید موسوی","موسوی مقدم","کامران","حمیدرضا","تقی","ناصر","هاشم","محمدحسن","حشمت‌الله","سیدمجید",
    
    # Education
    "کنکور","درس","درسی","امتحان","المپیاد","امتیازی","ترم","ترم‌های","کلاس","امتحانی","استاد","دکتر","پژوهشگر","پروفسور",
    "پایان نامه","دانشجو","دانش آموز","مدرس","جزوه","معلم","دبیرستان","مقطع","کارشناسی","کارشناسی ارشد","دکترا","جلد","دروس",
    "دکتری","اندیشه 1","اندیشه یک","اندیشه ۱","اندیشه 2","اندیشه دو","اندیشه ۲","رتبه","نمره","شاعر","آکادمی","ریاضی","قلمچی",

    # Commerce
    "پوشاک","آگهی","تور","لیدر","کارشناس","قرعه کشی","قرعه‌کشی","تخفیف","حراج","برند","بازاریابی","چک","حمل",
    "تبلیغات","سفارش","فروش","ویژه","کالای","نمایندگی","خرید","فروشگاه","عمده","عمده‌فروشی","ارزان","قیمت",
    "سند","برج","بیمه‌بازار","بیمه","بورس","بهره",

    # Media
    "سینما","موسیقی","کنسرت","تئاتر","فیلم","سریال","هنر","شعر","شاهنامه","ترانه","رمان",
    "خواننده","بازیگر","کارگردان","آلبوم","کلیپ","دوبله","زبان انگلیسی","ترجمه","کتاب",
    "آهنگ","رپر","خوانندگان","مدیا",

    # Law
    "حبس","اعدام","پرونده","جنايت","قتل","قاچاق","دادگاه","بازداشت","زندان","وثیقه","شکایت","بازپرس",
    "سرقت","محاکمه","جرم","مجرم","کیفرخواست","بازجویی","تعقیب قضایی","فساد","ارتشا","رشوه","اختلاس",
    "آدم ربایی","آدم‌ربایی","سارق","مسروقه","دزد","وکیل","ضدسرقت","ضد سرقت","قضائیه","قضاییه","قاضی",
    "قضات","دادنامه","ای دادرس","دادگری","دادخواهان","دادبین","انتحاری","متهم",

    # Work
    "کارمند","کارمندی","کارگر","کارگری","شغل","استخدام","رزومه","شرکت","بخش خصوصی","دفتر","غواصی",
    "مدیر","مدیریت","پیمانکار","کارآموز","موسسه","اداره","بنگاه","صنعت","کارخانه","مهندس",
    "آتش‌نشان","آتش‌ نشان","هلال احمر","هلال‌احمر","پلیس","راه‌سازی","روزنامه‌نگار","روزنامه‌ نگار",

    # Tech
    "اکانت","پیج","لینکدین","هک","ربات","کافکا","ایکس","اپلیکیشن","سایت","وبلاگ","اینترنت","واتساپ","اینستاگرام",
    "تلگرام","فیس بوک","فیسبوک","یوتیوب","توییتر","وبسایت","رمزارز","بیت کوین","اتریوم","اندروید","اپل","آیفون",
    "ویندوز","هوش مصنوعی","چت جی پی تی","دیجیتال","برق","کاربر","گپ",

    # Misc
    "مسابقه پیامکی","تسلیت","اعلان","مناقصه","مزایده","خدمات","کلاس خصوصی","دعوت","خوش آمدید","باران","زنبور",
    "سفر","گردشگری","بلیط","هتل","مسافرت","تور خارجی","ویزا","پاسپورت","هواپیما","قطار","ماشین","اتوبوس","باد",
    "حیوان","سگ","گربه","پرنده","باغ","ویلا","زمین","املاک","خودرو","بیماری","سلامت","دارو","پزشکی","مطب","چوب",
    "تولد","اعراب","فراخوان","تعقیب","منزوی","افغان","افغان‌ها","افغان‌های","افغان‌هایی","گنجشک","ایگل","آسانسور",
    "آقای","اقای","آقا","اقا","شادروان","کوره","طلا","مرحوم","مرغ","جوانمرگ","فلزیجات","کارواش","ارد","آرد","نعره",
    "بچه","بچّه","کبک","بنزین","هاوک","بارش","بارش‌ها","بخیه","عشق","سلام_امام_زمانم","سرهنگ","درگذشت","نسیم","گیلکی",
    "فریاد","نفوذ","سکس","سکسی","هموطن","نفت","کولر","چایی","پلنگ","تیمیرائوس","سرگرد","وارث","شیرمرد"
]

must_not_country_block = [

    # Geographic
    'شوروی','گرنادا','دومینیکا','پالائو','موزامبیک','صهیونیست','جزایر مارشال','رژیم صهیونیستی','کره شمالی','جمهوری ایرلند','گواتمالا','بحرین',
    'کیپ ورد','لیتوانی','مالزی','پاپوآ گینه نو','ایجرود','سومالی','گویان','هندوراس','وانواتو','غزه','آمریکایی','لهستان','کلمبیا','شانگهای',
    'زیمبابوه','گرجستان','مصر','نیکاراگوا','هائیتی','بلغارستان','لیبریا','السالوادور','ترکیه','رشتخوار','کومور','کامبوج','بوتسوانا','موریس',
    'هند','هندوستان','حوثیها','پاناما','نواتیم','مونته نگرو','خان یونس','حوثی','استرالیا','هلند','عربستان سعودی','برونئی','لائوس','غنا','اسراییلی',
    'کرۀ شمالی','موناکو','لبنان','لوکزامبورگ','لیسوتو','لارستان','اوکراین','عبری','پاراگوئه','نپال','سنت وینسنت و گرنادین‌ها','پاکستان','فرانسه',
    'کیریباتی','برزیل','مالت','میانمار','ترکمنستان','ویتنام','گینه استوایی','مالاوی','حماس','سنت لوسیا','توگو','صربستان','امارات','آلبانی',
    'سان مارینو','ماداگاسکار','فنلاند','رژیم','نیوزیلند','اشغالی','سنگال','بلژیک','کرواسی','چهارباغ','روسیه','بلاروس','صومعه‌سرا','ایتالیا','بلیز',
    'ساوجبلاغ','کوزوو','لیختن اشتاین','جامائیکا','کوریای شمالی','صگیون','سیرالئون','ازبکستان','راستین ایرلند','کنیا','اتریش','اسراییل','اسرائیل',
    'گابن','مالدیو','اردن','مراکش','جمهوری چک','یونان','پرتغال','سودان','آمریکا','تایلند','کره‌شمالی','فیجی','مولداوی','کره جنوبی','زامبیا','تونگا',
    'رومانی','جمهوری آفریقای مرکزی','تشرین','سنگاپور','کوبا','آلمان','آندورا','بورکینافاسو','دانمارک','کویت','سنت کیتس و نویس','باهاما','شهربابک',
    'بنین','عربستان','صنعا','ایسلند','تووالو','منعا','بوروندی','استونی','بوتان','ترینیداد و توباگو','سریلانکا','بیرم','پرو','اکوادور','البراجنه',
    'مغولستان','عراق','رژیم‌صهیونیستی','قزاقستان','گنبدکاووس','تیمور شرقی','نامیبیا','جمهوری دومینیکن','باربادوس','اسرائیل','سودان جنوبی','اوکراینی',
    'تونس','کرۀ جنوبی','شیلی','آفریقای جنوبی','کنگو','سورینام','ارمنستان','اسرائیله','نروژ','لتونی','اروگوئه','صهیونیستی','جیبوتی','مالی','قبرس',
    'رواندا','اسواتینی','سوئیس','بنگلادش','ساموآ','ایرلند','قطر','نبطیه','مجارستان','لبنان','چاد','قرقیزستان','کانادا','گامبیا','سائوتومه و پرینسیپ',
    'اسلواکی','اریتره','آذربایجان','فیلیپین','رضوانشهر','بولیوی','نائورو','چین','یمنی','میکرونزی','پشرت','فلسطین','اتیوپی','مقدونیه شمالی','ونزوئلا',
    'بریتانیا','بوسنی و هرزگوین','حلقه','آرژانتین','مسکو','واتیکان','لردگان','گینه','تاجیکستان','یمن','سوئد','نیکاراگوئه','امریکا','نیجریه','تانزانیا',
    'اوگاندا','الجزایر','کاستاریکا','امارات متحده عربی','آنگولا','سیشل','تایوان','اسلوونی','نیجر','یونس‌خان','اندونزی','ژاپن','جزایر سلیمان','سوریه',
    'اسرائیلی','ایالات متحده','افغانستان','جبالیا','عمان','گینه بیسائو','مکزیک','کامرون','لیبی','دمشق','موریتانی',

    "اتحادیه اروپا","مسلمانان","جومونگ","طالبان","چوسان","گوگوریو","هگست"
]